{
    "forest_adventure": {
        "name": "森林冒险",
        "description": "A forest adventure",
        "hanzi": [
            "小明想去森林。",
            "森林很大，有很多树。",
            "夏天，森林很热。冬天，森林很冷。",
            "小明问：\"为什么森林这么有意思？\"",
            "妈妈说：\"因为森林有很多可爱的动物。\"",
            "小明说：\"我想看看！\""
        ],
        "pinyin": [
            "Xiǎo Míng xiǎng qù sēnlín.",
            "Sēnlín hěn dà, yǒu hěn duō shù.",
            "Xiàtiān, sēnlín hěn rè. Dōngtiān, sēnlín hěn lěng.",
            "Xiǎo Míng wèn: \"Wèishéme sēnlín zhème yǒu yìsi?\"",
            "Māma shuō: \"Yīnwèi sēnlín yǒu hěn duō kě'ài de dòngwù.\"",
            "Xiǎo Míng shuō: \"Wǒ xiǎng kànkan!\""
        ],
        "english": [
            "Xiao Ming wants to go to the forest.",
            "The forest is very big and has many trees.",
            "In summer, the forest is hot. In winter, the forest is cold.",
            "Xiao Ming asks, \"Why is the forest so interesting?\"",
            "Mom says, \"Because the forest has many cute animals.\"",
            "Xiao Ming says, \"I want to see them!\""
        ]
    },
    "ice_cream_shop": {
        "name": "冰淇淋店",
        "description": "An ice cream shop",
        "hanzi": [
            "小李的家人有一个冰淇淋店。",
            "这个冰淇淋店在东南方。",
            "冰淇淋很便宜，也很好吃。",
            "老板说：\"欢迎来我的店！\"",
            "一个客人问：\"一个冰淇淋多少钱？\"",
            "小李说：\"十块钱。\"",
            "客人说：\"太贵了！\"",
            "小李说：\"对不起，可是我们的冰淇淋很好吃。\""
        ],
        "pinyin": [
            "Xiǎo Lǐ de jiārén yǒu yī gè bīngqílín diàn.",
            "Zhè gè bīngqílín diàn zài dōngnán fāng.",
            "Bīngqílín hěn piányi, yě hěn hào chī.",
            "Lǎobǎn shuō: \"Huānyíng lái wǒ de diàn!\"",
            "Yī gè kèrén wèn: \"Yī gè bīngqílín duōshao qián?\"",
            "Xiǎo Lǐ shuō: \"Shí kuài qián.\"",
            "Kèrén shuō: \"Tài guì le!\"",
            "Xiǎo Lǐ shuō: \"Duìbuqǐ, kěshì wǒmen de bīngqílín hěn hào chī.\""
        ],
        "english": [
            "Xiao Li's family has an ice cream shop.",
            "This ice cream shop is in the southeast.",
            "The ice cream is cheap and delicious.",
            "The boss says, \"Welcome to my shop!\"",
            "A customer asks, \"How much is one ice cream?\"",
            "Xiao Li says, \"Ten yuan.\"",
            "The customer says, \"That's too expensive!\"",
            "Xiao Li says, \"I'm sorry, but our ice cream is very delicious.\""
        ]
    },
    "world_map": {
        "name": "世界地图",
        "description": "Learning from a world map",
        "hanzi": [
            "小红有一个世界地图。",
            "她想学习地图上的地方。",
            "妈妈问：\"你为什么对地图有兴趣？\"",
            "小红说：\"因为世界很大，我想看看。\"",
            "妈妈说：\"地图上有很多国家。\"",
            "小红问：\"中国在哪里？\"",
            "妈妈说：\"在东方。\"",
            "小红说：\"我想去中国！\"",
            "妈妈笑着说：\"当然可以，我们一起去。\""
        ],
        "pinyin": [
            "Xiǎo Hóng yǒu yī gè shìjiè dìtú.",
            "Tā xiǎng xuéxí dìtú shàng de dìfāng.",
            "Māma wèn: \"Nǐ wèishéme duì dìtú yǒu xìngqù?\"",
            "Xiǎo Hóng shuō: \"Yīnwèi shìjiè hěn dà, wǒ xiǎng kànkan.\"",
            "Māma shuō: \"Dìtú shàng yǒu hěn duō guójiā.\"",
            "Xiǎo Hóng wèn: \"Zhōngguó zài nǎlǐ?\"",
            "Māma shuō: \"Zài dōngfāng.\"",
            "Xiǎo Hóng shuō: \"Wǒ xiǎng qù Zhōngguó!\"",
            "Māma xiàozhe shuō: \"Dāngrán kěyǐ, wǒmen yīqǐ qù.\""
        ],
        "english": [
            "Xiao Hong has a world map.",
            "She wants to learn about the places on the map.",
            "Mom asks, \"Why are you interested in the map?\"",
            "Xiao Hong says, \"Because the world is big, I want to see it.\"",
            "Mom says, \"There are many countries on the map.\"",
            "Xiao Hong asks, \"Where is China?\"",
            "Mom says, \"In the east.\"",
            "Xiao Hong says, \"I want to go to China!\"",
            "Mom smiles and says, \"Of course, we can go together.\""
        ]
    },
    "library": {
        "name": "图书馆",
        "description": "A curious student in a library",
        "hanzi": [
            "小明喜欢去图书馆。",
            "图书馆有很多书。",
            "小明每天下午都去图书馆。",
            "他喜欢看中文书和英文书。",
            "今天，小明想找一本关于动物的书。",
            "他问图书管理员：\"请问，动物的书在哪里？\"",
            "图书管理员说：\"在二楼。\"",
            "小明去了二楼，找到了那本书。",
            "他很高兴，说：\"谢谢！\"",
            "图书管理员说：\"不客气。\"",
            "小明坐在椅子上看书。",
            "书里的动物很有趣。",
            "他最喜欢书里的大象。",
            "大象很大，也很聪明。",
            "小明想：\"我明天还要来图书馆。\""
        ],
        "pinyin": [
            "Xiǎo Míng xǐhuān qù túshūguǎn.",
            "Túshūguǎn yǒu hěn duō shū.",
            "Xiǎo Míng měitiān xiàwǔ dōu qù túshūguǎn.",
            "Tā xǐhuān kàn Zhōngwén shū hé Yīngwén shū.",
            "Jīntiān, Xiǎo Míng xiǎng zhǎo yī běn guānyú dòngwù de shū.",
            "Tā wèn túshū guǎnlǐ yuán: \"Qǐngwèn, dòngwù de shū zài nǎlǐ?\"",
            "Túshū guǎnlǐ yuán shuō: \"Zài èr lóu.\"",
            "Xiǎo Míng qùle èr lóu, zhǎodàole nà běn shū.",
            "Tā hěn gāoxìng, shuō: \"Xièxiè!\"",
            "Túshū guǎnlǐ yuán shuō: \"Bù kèqì.\"",
            "Xiǎo Míng zuò zài yǐzi shàng kàn shū.",
            "Shū lǐ de dòngwù hěn yǒuqù.",
            "Tā zuì xǐhuān shū lǐ de dàxiàng.",
            "Dàxiàng hěn dà, yě hěn cōngmíng.",
            "Xiǎo Míng xiǎng: \"Wǒ míngtiān hái yào lái túshūguǎn.\""
        ],
        "english": [
            "Xiao Ming likes to go to the library.",
            "The library has many books.",
            "Xiao Ming goes to the library every afternoon.",
            "He likes to read Chinese books and English books.",
            "Today, Xiao Ming wants to find a book about animals.",
            "He asks the librarian, \"Excuse me, where are the books about animals?\"",
            "The librarian says, \"On the second floor.\"",
            "Xiao Ming goes to the second floor and finds the book.",
            "He is very happy and says, \"Thank you!\"",
            "The librarian says, \"You're welcome.\"",
            "Xiao Ming sits on a chair and reads the book.",
            "The animals in the book are very interesting.",
            "He likes the elephant in the book the most.",
            "The elephant is very big and very smart.",
            "Xiao Ming thinks, \"I will come back to the library tomorrow.\""
        ]
    },
    "library2": {
        "name": "另一个图书馆"  ,
        "description": "Another story about a library",
        "hanzi": [
            "小明喜欢去图书馆。",
            "图书馆里有很多书。",
            "他每天都去图书馆看书。",
            "有一天，他找到一本很有意思的书。",
            "他问图书馆员：\"我可以借这本书吗？\"",
            "图书馆员说：\"当然可以，你可以借十天。\"",
            "小明很高兴，他带着书回家了。",
            "十天后，小明又去了图书馆，还了书。"
        ],
        "pinyin": [
            "Xiǎo Míng xǐhuān qù túshūguǎn.",
            "Túshūguǎn lǐ yǒu hěn duō shū.",
            "Tā měitiān dōu qù túshūguǎn kàn shū.",
            "Yǒu yī tiān, tā zhǎodào yī běn hěn yǒuyìsi de shū.",
            "Tā wèn túshūguǎnyuán: \"Wǒ kěyǐ jiè zhè běn shū ma?\"",
            "Túshūguǎnyuán shuō: \"Dāngrán kěyǐ, nǐ kěyǐ jiè shí tiān.\"",
            "Xiǎo Míng hěn gāoxìng, tā dàizhe shū huí jiā le.",
            "Shí tiān hòu, Xiǎo Míng yòu qùle túshūguǎn, huánle shū."
        ],
        "english": [
            "Xiao Ming likes to go to the library.",
            "There are many books in the library.",
            "He goes to the library to read every day.",
            "One day, he found a very interesting book.",
            "He asked the librarian: \"Can I borrow this book?\"",
            "The librarian said: \"Of course, you can borrow it for ten days.\"",
            "Xiao Ming was very happy and took the book home.",
            "Ten days later, Xiao Ming went to the library again and returned the book."
        ]
    },
    "bus_stop": {
        "name": "公共汽车站",
        "description": "Bus stop",
        "hanzi": [
            "小张每天坐公共汽车去学校。",
            "今天，他到了公共汽车站，看见很多人。",
            "他问一个人：\"公共汽车什么时候来？\"",
            "那个人说：\"五分钟后。\"",
            "五分钟后，公共汽车来了。",
            "小张上了车，找了一个座位坐下。",
            "他看见一个老人站着，就站起来说：\"请坐！\"",
            "老人笑着说：\"谢谢你！\""
        ],
        "pinyin": [
            "Xiǎo Zhāng měitiān zuò gōnggòng qìchē qù xuéxiào.",
            "Jīntiān, tā dàole gōnggòng qìchē zhàn, kànjiàn hěn duō rén.",
            "Tā wèn yīgè rén: \"Gōnggòng qìchē shénme shíhòu lái?\"",
            "Nàgè rén shuō: \"Wǔ fēnzhōng hòu.\"",
            "Wǔ fēnzhōng hòu, gōnggòng qìchē láile.",
            "Xiǎo Zhāng shàngle chē, zhǎole yīgè zuòwèi zuòxià.",
            "Tā kànjiàn yīgè lǎorén zhànzhe, jiù zhàn qǐlái shuō: \"Qǐng zuò!\"",
            "Lǎorén xiàozhe shuō: \"Xièxiè nǐ!\""
        ],
        "english": [
            "Xiao Zhang takes the bus to school every day.",
            "Today, he arrived at the bus stop and saw many people.",
            "He asked someone: \"When will the bus come?\"",
            "The person said: \"In five minutes.\"",
            "Five minutes later, the bus arrived.",
            "Xiao Zhang got on the bus and found a seat.",
            "He saw an old man standing, so he stood up and said: \"Please sit!\"",
            "The old man smiled and said: \"Thank you!\""
        ]
    }
}
