{
    "story_001": {
        "hanzi": [
            "一个奇怪的家庭",
            "在一条安静的小路上有一个家。",
            "这个家里住着三个人。",
            "爸爸叫弗农，他很胖，有大胡子。",
            "妈妈叫佩妮，她很瘦，头发是黄色的。",
            "他们有一个儿子叫达力。",
            "达力和爸爸一样胖。",
            "这个家庭觉得自己很普通。",
            "他们不喜欢奇怪的事情。",
            "每天早上，弗农对佩妮说：\"我去上班了。\"",
            "佩妮回答：\"好的，路上小心。\"",
            "弗农在一个做工具的公司工作。",
            "佩妮在家里做家务。",
            "她喜欢看邻居家发生了什么。",
            "达力去学校，但他不喜欢学习。",
            "他喜欢玩游戏和吃东西。",
            "有一天，他们收到了一封奇怪的信。",
            "这封信是给他们的侄子哈利的。",
            "哈利的爸爸妈妈去世了。",
            "所以哈利和弗农一家住在一起。",
            "弗农看到这封信，很生气。",
            "他对佩妮说：\"这是什么？\"",
            "佩妮说：\"我不知道。我们不要给哈利。\"",
            "弗农把信扔掉了。",
            "第二天，又来了很多信。",
            "弗农更生气了。",
            "他大喊：\"为什么还有信？\"",
            "他把所有的信都扔了。",
            "但是信还是一直来。",
            "弗农对家人说：\"我们要离开这里。\"",
            "他们开车去了很远的地方。",
            "但是信还是找到了他们。",
            "弗农不知道该怎么办了。",
            "最后，有一个很高的人来了。",
            "他敲门说：\"你好，我是来见哈利的。\"",
            "他告诉哈利一个秘密。",
            "\"哈利，你是个魔法师。\"",
            "哈利很惊讶，问：\"我是魔法师？真的吗？\"",
            "高个子人说：\"是的，你要去魔法学校。\"",
            "哈利很兴奋能离开这个家。",
            "弗农生气地说：\"他不能去！\"",
            "但是他们没办法阻止哈利。",
            "哈利终于可以去新的地方了。",
            "这个故事告诉我们每个人都是特别的。",
            "即使别人觉得你奇怪，你可能有特殊的才能。"
        ],
        "pinyin": [
            "Yī gè qíguài de jiātíng",
            "Zài yī tiáo ānjìng de xiǎo lù shàng yǒu yī gè jiā.",
            "Zhè gè jiā lǐ zhù zhe sān gè rén.",
            "Bàba jiào Fúnán, tā hěn pàng, yǒu dà húzi.",
            "Māma jiào Péiní, tā hěn shòu, tóufa shì huángsè de.",
            "Tāmen yǒu yī gè érzi jiào Dálì.",
            "Dálì hé bàba yīyàng pàng.",
            "Zhè gè jiātíng juéde zìjǐ hěn pǔtōng.",
            "Tāmen bù xǐhuan qíguài de shìqing.",
            "Měi tiān zǎoshang, Fúnán duì Péiní shuō: \"Wǒ qù shàngbān le.\"",
            "Péiní huídá: \"Hǎo de, lùshang xiǎoxīn.\"",
            "Fúnán zài yī gè zuò gōngjù de gōngsī gōngzuò.",
            "Péiní zài jiā lǐ zuò jiāwù.",
            "Tā xǐhuan kàn línjū jiā fāsheng le shénme.",
            "Dálì qù xuéxiào, dàn tā bù xǐhuan xuéxí.",
            "Tā xǐhuan wán yóuxì hé chī dōngxi.",
            "Yǒu yī tiān, tāmen shōu dào le yī fēng qíguài de xìn.",
            "Zhè fēng xìn shì gěi tāmen de zhízi Hālì de.",
            "Hālì de bàba māma qùshì le.",
            "Suǒyǐ Hālì hé Fúnán yī jiā zhù zài yīqǐ.",
            "Fúnán kàn dào zhè fēng xìn, hěn shēngqì.",
            "Tā duì Péiní shuō: \"Zhè shì shénme?\"",
            "Péiní shuō: \"Wǒ bù zhīdào. Wǒmen bú yào gěi Hālì.\"",
            "Fúnán bǎ xìn rēng diào le.",
            "Dì èr tiān, yòu lái le hěn duō xìn.",
            "Fúnán gèng shēngqì le.",
            "Tā dà hǎn: \"Wèishénme hái yǒu xìn?\"",
            "Tā bǎ suǒyǒu de xìn dōu rēng le.",
            "Dànshì xìn hái shì yīzhí lái.",
            "Fúnán duì jiārén shuō: \"Wǒmen yào líkāi zhèlǐ.\"",
            "Tāmen kāichē qù le hěn yuǎn de dìfang.",
            "Dànshì xìn hái shì zhǎodào le tāmen.",
            "Fúnán bù zhīdào gāi zěnme bàn le.",
            "Zuìhòu, yǒu yī gè hěn gāo de rén lái le.",
            "Tā qiāo mén shuō: \"Nǐ hǎo, wǒ shì lái jiàn Hālì de.\"",
            "Tā gàosu Hālì yī gè mìmì.",
            "\"Hālì, nǐ shì gè mófǎ shī.\"",
            "Hālì hěn jīngyà, wèn: \"Wǒ shì mófǎ shī? Zhēn de ma?\"",
            "Gāo gèzi rén shuō: \"Shì de, nǐ yào qù mófǎ xuéxiào.\"",
            "Hālì hěn xīngfèn néng líkāi zhè gè jiā.",
            "Fúnán shēngqì de shuō: \"Tā bù néng qù!\"",
            "Dànshì tāmen méi bànfǎ zǔzhǐ Hālì.",
            "Hālì zhōngyú kěyǐ qù xīn de dìfang le.",
            "Zhè gè gùshi gàosu wǒmen měi gè rén dōu shì tèbié de.",
            "Jíshǐ biérén juéde nǐ qíguài, nǐ kěnéng yǒu tèshū de cáinéng."
        ],
        "english": [
            "A Strange Family",
            "There was a house on a quiet street.",
            "Three people lived in this house.",
            "The father was called Vernon, he was fat and had a big mustache.",
            "The mother was called Petunia, she was thin with yellow hair.",
            "They had a son named Dudley.",
            "Dudley was as fat as his father.",
            "This family thought they were very normal.",
            "They didn't like strange things.",
            "Every morning, Vernon said to Petunia: \"I'm going to work.\"",
            "Petunia replied: \"Okay, be careful on the way.\"",
            "Vernon worked at a company that made tools.",
            "Petunia did housework at home.",
            "She liked to watch what happened at the neighbors' houses.",
            "Dudley went to school, but he didn't like studying.",
            "He liked playing games and eating.",
            "One day, they received a strange letter.",
            "This letter was for their nephew, Harry.",
            "Harry's parents had died.",
            "So Harry lived with Vernon's family.",
            "Vernon was very angry when he saw this letter.",
            "He said to Petunia: \"What is this?\"",
            "Petunia said: \"I don't know. We shouldn't give it to Harry.\"",
            "Vernon threw the letter away.",
            "The next day, many more letters came.",
            "Vernon got even angrier.",
            "He shouted: \"Why are there more letters?\"",
            "He threw away all the letters.",
            "But the letters kept coming.",
            "Vernon said to his family: \"We need to leave here.\"",
            "They drove to a place far away.",
            "But the letters still found them.",
            "Vernon didn't know what to do.",
            "Finally, a very tall person came.",
            "He knocked and said: \"Hello, I'm here to see Harry.\"",
            "He told Harry a secret.",
            "\"Harry, you're a wizard.\"",
            "Harry was surprised and asked: \"I'm a wizard? Really?\"",
            "The tall person said: \"Yes, you're going to a magic school.\"",
            "Harry was excited to leave this house.",
            "Vernon angrily said: \"He can't go!\"",
            "But they couldn't stop Harry.",
            "Harry could finally go to a new place.",
            "This story tells us that everyone is special.",
            "Even if others think you're strange, you might have special talents."
        ]
    },
    "story_002": {
        "hanzi": [
            "动物园的奇怪事",
            "今天是达力的生日。",
            "达力想去动物园。",
            "弗农叔叔说：\"好，我们全家去。\"",
            "佩妮阿姨问：\"哈利怎么办？\"",
            "弗农叔叔不高兴地说：\"他也得去。\"",
            "哈利很惊讶，他从来没去过动物园。",
            "他们坐车去了动物园。",
            "达力和他的朋友皮尔斯很兴奋。",
            "哈利走在后面，很安静。",
            "他们先去看了大象。",
            "达力说：\"这大象太没意思了。\"",
            "然后他们去了爬行动物馆。",
            "里面很暗，很凉快。",
            "哈利看到了一条大蛇。",
            "蛇睡着了，一动不动。",
            "达力说：\"让它动一动！\"",
            "弗农叔叔敲了敲玻璃，蛇还是不动。",
            "达力走开了，觉得没意思。",
            "哈利站在玻璃前，看着蛇。",
            "突然，蛇睁开了眼睛。",
            "蛇慢慢地抬起头，看着哈利。",
            "哈利觉得很奇怪，他对蛇说：\"你好。\"",
            "更奇怪的是，蛇点了点头。",
            "哈利又说：\"你来自哪里？\"",
            "蛇用尾巴指了指一个牌子。",
            "牌子上写着：\"巴西蟒蛇\"。",
            "这时，达力大叫：\"看！蛇在动！\"",
            "他推开哈利，贴在玻璃上看。",
            "哈利生气了，他瞪着达力。",
            "突然，玻璃不见了！",
            "达力掉进了蛇的池子里。",
            "蛇爬了出来，从哈利身边经过。",
            "蛇说：\"谢谢你，朋友。\"",
            "哈利吓了一跳，蛇会说话！",
            "动物园里的人都在尖叫。",
            "蛇慢慢地爬走了。",
            "弗农叔叔非常生气。",
            "他对哈利喊：\"这是你干的！\"",
            "哈利说：\"我不知道发生了什么。\"",
            "但是没人相信他。",
            "回家后，哈利被关在了楼梯下的小房间里。",
            "他躺在床上想：\"为什么奇怪的事总是发生在我身上？\""
        ],
        "pinyin": [
            "Dòngwùyuán de qíguài shì",
            "Jīntiān shì Dálì de shēngrì.",
            "Dálì xiǎng qù dòngwùyuán.",
            "Fúnán shūshu shuō: \"Hǎo, wǒmen quán jiā qù.\"",
            "Péiní āyí wèn: \"Hālì zěnme bàn?\"",
            "Fúnán shūshu bù gāoxìng de shuō: \"Tā yě děi qù.\"",
            "Hālì hěn jīngyà, tā cóng lái méi qùguò dòngwùyuán.",
            "Tāmen zuò chē qù le dòngwùyuán.",
            "Dálì hé tā de péngyou Pí'ěrsī hěn xīngfèn.",
            "Hālì zǒu zài hòumiàn, hěn ānjìng.",
            "Tāmen xiān qù kàn le dàxiàng.",
            "Dálì shuō: \"Zhè dàxiàng tài méi yìsi le.\"",
            "Ránhòu tāmen qù le pá xíng dòngwù guǎn.",
            "Lǐmiàn hěn àn, hěn liángkuai.",
            "Hālì kàn dào le yī tiáo dà shé.",
            "Shé shuì zhe le, yī dòng bù dòng.",
            "Dálì shuō: \"Ràng tā dòng yī dòng!\"",
            "Fúnán shūshu qiāo le qiāo bōli, shé hái shì bú dòng.",
            "Dálì zǒu kāi le, juéde méi yìsi.",
            "Hālì zhàn zài bōli qián, kàn zhe shé.",
            "Tūrán, shé zhēng kāi le yǎnjing.",
            "Shé màn man de tái qǐ tóu, kàn zhe Hālì.",
            "Hālì juéde hěn qíguài, tā duì shé shuō: \"Nǐ hǎo.\"",
            "Gèng qíguài de shì, shé diǎn le diǎn tóu.",
            "Hālì yòu shuō: \"Nǐ lái zì nǎlǐ?\"",
            "Shé yòng wěiba zhǐ le zhǐ yī gè páizi.",
            "Páizi shàng xiě zhe: \"Bāxī mǎnshé\".",
            "Zhè shí, Dálì dà jiào: \"Kàn! Shé zài dòng!\"",
            "Tā tuī kāi Hālì, tiē zài bōli shàng kàn.",
            "Hālì shēngqì le, tā dèng zhe Dálì.",
            "Tūrán, bōli bú jiàn le!",
            "Dálì diào jìn le shé de chí zi lǐ.",
            "Shé pá le chūlái, cóng Hālì shēnbiān jīngguò.",
            "Shé shuō: \"Xièxie nǐ, péngyou.\"",
            "Hālì xià le yī tiào, shé huì shuōhuà!",
            "Dòngwùyuán lǐ de rén dōu zài jiān jiào.",
            "Shé màn man de pá zǒu le.",
            "Fúnán shūshu fēicháng shēngqì.",
            "Tā duì Hālì hǎn: \"Zhè shì nǐ gàn de!\"",
            "Hālì shuō: \"Wǒ bù zhīdào fāsheng le shénme.\"",
            "Dànshì méi rén xiāngxìn tā.",
            "Huí jiā hòu, Hālì bèi guān zài le lóutī xià de xiǎo fángjiān lǐ.",
            "Tā tǎng zài chuáng shàng xiǎng: \"Wèishénme qíguài de shì zǒng shì fāsheng zài wǒ shēnshang?\""
        ],
        "english": [
            "The Strange Incident at the Zoo",
            "Today is Dudley's birthday.",
            "Dudley wants to go to the zoo.",
            "Uncle Vernon says: \"Okay, we'll all go.\"",
            "Aunt Petunia asks: \"What about Harry?\"",
            "Uncle Vernon says unhappily: \"He has to come too.\"",
            "Harry is surprised, he has never been to a zoo before.",
            "They drive to the zoo.",
            "Dudley and his friend Piers are excited.",
            "Harry walks behind, very quiet.",
            "They first go to see the elephants.",
            "Dudley says: \"This elephant is so boring.\"",
            "Then they go to the reptile house.",
            "It's dark and cool inside.",
            "Harry sees a big snake.",
            "The snake is asleep, not moving at all.",
            "Dudley says: \"Make it move!\"",
            "Uncle Vernon taps on the glass, but the snake still doesn't move.",
            "Dudley walks away, feeling bored.",
            "Harry stands in front of the glass, looking at the snake.",
            "Suddenly, the snake opens its eyes.",
            "The snake slowly raises its head, looking at Harry.",
            "Harry finds it strange and says to the snake: \"Hello.\"",
            "Even stranger, the snake nods its head.",
            "Harry says again: \"Where are you from?\"",
            "The snake points its tail at a sign.",
            "The sign says: \"Boa Constrictor, Brazil\".",
            "At this moment, Dudley shouts: \"Look! The snake is moving!\"",
            "He pushes Harry away and presses against the glass to look.",
            "Harry gets angry and glares at Dudley.",
            "Suddenly, the glass disappears!",
            "Dudley falls into the snake's pool.",
            "The snake crawls out, passing by Harry.",
            "The snake says: \"Thank you, friend.\"",
            "Harry is startled, the snake can talk!",
            "People in the zoo are all screaming.",
            "The snake slowly crawls away.",
            "Uncle Vernon is very angry.",
            "He shouts at Harry: \"You did this!\"",
            "Harry says: \"I don't know what happened.\"",
            "But no one believes him.",
            "After returning home, Harry is locked in the small room under the stairs.",
            "He lies on the bed thinking: \"Why do strange things always happen to me?\""
        ]
    }
}
