{
    "story_001": {
        "hanzi": [
            "一个奇怪的家庭",
            "在一条安静的小路上有一个家。",
            "这个家里住着三个人。",
            "爸爸叫弗农，他很胖，有大胡子。",
            "妈妈叫佩妮，她很瘦，头发是黄色的。",
            "他们有一个儿子叫达力。",
            "达力和爸爸一样胖。",
            "这个家庭觉得自己很普通。",
            "他们不喜欢奇怪的事情。",
            "每天早上，弗农对佩妮说：\"我去上班了。\"",
            "佩妮回答：\"好的，路上小心。\"",
            "弗农在一个做工具的公司工作。",
            "佩妮在家里做家务。",
            "她喜欢看邻居家发生了什么。",
            "达力去学校，但他不喜欢学习。",
            "他喜欢玩游戏和吃东西。",
            "有一天，他们收到了一封奇怪的信。",
            "这封信是给他们的侄子哈利的。",
            "哈利的爸爸妈妈去世了。",
            "所以哈利和弗农一家住在一起。",
            "弗农看到这封信，很生气。",
            "他对佩妮说：\"这是什么？\"",
            "佩妮说：\"我不知道。我们不要给哈利。\"",
            "弗农把信扔掉了。",
            "第二天，又来了很多信。",
            "弗农更生气了。",
            "他大喊：\"为什么还有信？\"",
            "他把所有的信都扔了。",
            "但是信还是一直来。",
            "弗农对家人说：\"我们要离开这里。\"",
            "他们开车去了很远的地方。",
            "但是信还是找到了他们。",
            "弗农不知道该怎么办了。",
            "最后，有一个很高的人来了。",
            "他敲门说：\"你好，我是来见哈利的。\"",
            "他告诉哈利一个秘密。",
            "\"哈利，你是个魔法师。\"",
            "哈利很惊讶，问：\"我是魔法师？真的吗？\"",
            "高个子人说：\"是的，你要去魔法学校。\"",
            "哈利很兴奋能离开这个家。",
            "弗农生气地说：\"他不能去！\"",
            "但是他们没办法阻止哈利。",
            "哈利终于可以去新的地方了。",
            "这个故事告诉我们每个人都是特别的。",
            "即使别人觉得你奇怪，你可能有特殊的才能。"
        ],
        "pinyin": [
            "Yī gè qíguài de jiātíng",
            "Zài yī tiáo ānjìng de xiǎo lù shàng yǒu yī gè jiā.",
            "Zhè gè jiā lǐ zhù zhe sān gè rén.",
            "Bàba jiào Fúnán, tā hěn pàng, yǒu dà húzi.",
            "Māma jiào Péiní, tā hěn shòu, tóufa shì huángsè de.",
            "Tāmen yǒu yī gè érzi jiào Dálì.",
            "Dálì hé bàba yīyàng pàng.",
            "Zhè gè jiātíng juéde zìjǐ hěn pǔtōng.",
            "Tāmen bù xǐhuan qíguài de shìqing.",
            "Měi tiān zǎoshang, Fúnán duì Péiní shuō: \"Wǒ qù shàngbān le.\"",
            "Péiní huídá: \"Hǎo de, lùshang xiǎoxīn.\"",
            "Fúnán zài yī gè zuò gōngjù de gōngsī gōngzuò.",
            "Péiní zài jiā lǐ zuò jiāwù.",
            "Tā xǐhuan kàn línjū jiā fāsheng le shénme.",
            "Dálì qù xuéxiào, dàn tā bù xǐhuan xuéxí.",
            "Tā xǐhuan wán yóuxì hé chī dōngxi.",
            "Yǒu yī tiān, tāmen shōu dào le yī fēng qíguài de xìn.",
            "Zhè fēng xìn shì gěi tāmen de zhízi Hālì de.",
            "Hālì de bàba māma qùshì le.",
            "Suǒyǐ Hālì hé Fúnán yī jiā zhù zài yīqǐ.",
            "Fúnán kàn dào zhè fēng xìn, hěn shēngqì.",
            "Tā duì Péiní shuō: \"Zhè shì shénme?\"",
            "Péiní shuō: \"Wǒ bù zhīdào. Wǒmen bú yào gěi Hālì.\"",
            "Fúnán bǎ xìn rēng diào le.",
            "Dì èr tiān, yòu lái le hěn duō xìn.",
            "Fúnán gèng shēngqì le.",
            "Tā dà hǎn: \"Wèishénme hái yǒu xìn?\"",
            "Tā bǎ suǒyǒu de xìn dōu rēng le.",
            "Dànshì xìn hái shì yīzhí lái.",
            "Fúnán duì jiārén shuō: \"Wǒmen yào líkāi zhèlǐ.\"",
            "Tāmen kāichē qù le hěn yuǎn de dìfang.",
            "Dànshì xìn hái shì zhǎodào le tāmen.",
            "Fúnán bù zhīdào gāi zěnme bàn le.",
            "Zuìhòu, yǒu yī gè hěn gāo de rén lái le.",
            "Tā qiāo mén shuō: \"Nǐ hǎo, wǒ shì lái jiàn Hālì de.\"",
            "Tā gàosu Hālì yī gè mìmì.",
            "\"Hālì, nǐ shì gè mófǎ shī.\"",
            "Hālì hěn jīngyà, wèn: \"Wǒ shì mófǎ shī? Zhēn de ma?\"",
            "Gāo gèzi rén shuō: \"Shì de, nǐ yào qù mófǎ xuéxiào.\"",
            "Hālì hěn xīngfèn néng líkāi zhè gè jiā.",
            "Fúnán shēngqì de shuō: \"Tā bù néng qù!\"",
            "Dànshì tāmen méi bànfǎ zǔzhǐ Hālì.",
            "Hālì zhōngyú kěyǐ qù xīn de dìfang le.",
            "Zhè gè gùshi gàosu wǒmen měi gè rén dōu shì tèbié de.",
            "Jíshǐ biérén juéde nǐ qíguài, nǐ kěnéng yǒu tèshū de cáinéng."
        ],
        "english": [
            "A Strange Family (HP)",
            "There was a house on a quiet street.",
            "Three people lived in this house.",
            "The father was called Vernon, he was fat and had a big mustache.",
            "The mother was called Petunia, she was thin with yellow hair.",
            "They had a son named Dudley.",
            "Dudley was as fat as his father.",
            "This family thought they were very normal.",
            "They didn't like strange things.",
            "Every morning, Vernon said to Petunia: \"I'm going to work.\"",
            "Petunia replied: \"Okay, be careful on the way.\"",
            "Vernon worked at a company that made tools.",
            "Petunia did housework at home.",
            "She liked to watch what happened at the neighbors' houses.",
            "Dudley went to school, but he didn't like studying.",
            "He liked playing games and eating.",
            "One day, they received a strange letter.",
            "This letter was for their nephew, Harry.",
            "Harry's parents had died.",
            "So Harry lived with Vernon's family.",
            "Vernon was very angry when he saw this letter.",
            "He said to Petunia: \"What is this?\"",
            "Petunia said: \"I don't know. We shouldn't give it to Harry.\"",
            "Vernon threw the letter away.",
            "The next day, many more letters came.",
            "Vernon got even angrier.",
            "He shouted: \"Why are there more letters?\"",
            "He threw away all the letters.",
            "But the letters kept coming.",
            "Vernon said to his family: \"We need to leave here.\"",
            "They drove to a place far away.",
            "But the letters still found them.",
            "Vernon didn't know what to do.",
            "Finally, a very tall person came.",
            "He knocked and said: \"Hello, I'm here to see Harry.\"",
            "He told Harry a secret.",
            "\"Harry, you're a wizard.\"",
            "Harry was surprised and asked: \"I'm a wizard? Really?\"",
            "The tall person said: \"Yes, you're going to a magic school.\"",
            "Harry was excited to leave this house.",
            "Vernon angrily said: \"He can't go!\"",
            "But they couldn't stop Harry.",
            "Harry could finally go to a new place.",
            "This story tells us that everyone is special.",
            "Even if others think you're strange, you might have special talents."
        ]
    },
    "story_002": {
        "hanzi": [
            "动物园的奇怪事",
            "今天是达力的生日。",
            "达力想去动物园。",
            "弗农叔叔说：\"好，我们全家去。\"",
            "佩妮阿姨问：\"哈利怎么办？\"",
            "弗农叔叔不高兴地说：\"他也得去。\"",
            "哈利很惊讶，他从来没去过动物园。",
            "他们坐车去了动物园。",
            "达力和他的朋友皮尔斯很兴奋。",
            "哈利走在后面，很安静。",
            "他们先去看了大象。",
            "达力说：\"这大象太没意思了。\"",
            "然后他们去了爬行动物馆。",
            "里面很暗，很凉快。",
            "哈利看到了一条大蛇。",
            "蛇睡着了，一动不动。",
            "达力说：\"让它动一动！\"",
            "弗农叔叔敲了敲玻璃，蛇还是不动。",
            "达力走开了，觉得没意思。",
            "哈利站在玻璃前，看着蛇。",
            "突然，蛇睁开了眼睛。",
            "蛇慢慢地抬起头，看着哈利。",
            "哈利觉得很奇怪，他对蛇说：\"你好。\"",
            "更奇怪的是，蛇点了点头。",
            "哈利又说：\"你来自哪里？\"",
            "蛇用尾巴指了指一个牌子。",
            "牌子上写着：\"巴西蟒蛇\"。",
            "这时，达力大叫：\"看！蛇在动！\"",
            "他推开哈利，贴在玻璃上看。",
            "哈利生气了，他瞪着达力。",
            "突然，玻璃不见了！",
            "达力掉进了蛇的池子里。",
            "蛇爬了出来，从哈利身边经过。",
            "蛇说：\"谢谢你，朋友。\"",
            "哈利吓了一跳，蛇会说话！",
            "动物园里的人都在尖叫。",
            "蛇慢慢地爬走了。",
            "弗农叔叔非常生气。",
            "他对哈利喊：\"这是你干的！\"",
            "哈利说：\"我不知道发生了什么。\"",
            "但是没人相信他。",
            "回家后，哈利被关在了楼梯下的小房间里。",
            "他躺在床上想：\"为什么奇怪的事总是发生在我身上？\""
        ],
        "pinyin": [
            "Dòngwùyuán de qíguài shì",
            "Jīntiān shì Dálì de shēngrì.",
            "Dálì xiǎng qù dòngwùyuán.",
            "Fúnán shūshu shuō: \"Hǎo, wǒmen quán jiā qù.\"",
            "Péiní āyí wèn: \"Hālì zěnme bàn?\"",
            "Fúnán shūshu bù gāoxìng de shuō: \"Tā yě děi qù.\"",
            "Hālì hěn jīngyà, tā cóng lái méi qùguò dòngwùyuán.",
            "Tāmen zuò chē qù le dòngwùyuán.",
            "Dálì hé tā de péngyou Pí'ěrsī hěn xīngfèn.",
            "Hālì zǒu zài hòumiàn, hěn ānjìng.",
            "Tāmen xiān qù kàn le dàxiàng.",
            "Dálì shuō: \"Zhè dàxiàng tài méi yìsi le.\"",
            "Ránhòu tāmen qù le pá xíng dòngwù guǎn.",
            "Lǐmiàn hěn àn, hěn liángkuai.",
            "Hālì kàn dào le yī tiáo dà shé.",
            "Shé shuì zhe le, yī dòng bù dòng.",
            "Dálì shuō: \"Ràng tā dòng yī dòng!\"",
            "Fúnán shūshu qiāo le qiāo bōli, shé hái shì bú dòng.",
            "Dálì zǒu kāi le, juéde méi yìsi.",
            "Hālì zhàn zài bōli qián, kàn zhe shé.",
            "Tūrán, shé zhēng kāi le yǎnjing.",
            "Shé màn man de tái qǐ tóu, kàn zhe Hālì.",
            "Hālì juéde hěn qíguài, tā duì shé shuō: \"Nǐ hǎo.\"",
            "Gèng qíguài de shì, shé diǎn le diǎn tóu.",
            "Hālì yòu shuō: \"Nǐ lái zì nǎlǐ?\"",
            "Shé yòng wěiba zhǐ le zhǐ yī gè páizi.",
            "Páizi shàng xiě zhe: \"Bāxī mǎnshé\".",
            "Zhè shí, Dálì dà jiào: \"Kàn! Shé zài dòng!\"",
            "Tā tuī kāi Hālì, tiē zài bōli shàng kàn.",
            "Hālì shēngqì le, tā dèng zhe Dálì.",
            "Tūrán, bōli bú jiàn le!",
            "Dálì diào jìn le shé de chí zi lǐ.",
            "Shé pá le chūlái, cóng Hālì shēnbiān jīngguò.",
            "Shé shuō: \"Xièxie nǐ, péngyou.\"",
            "Hālì xià le yī tiào, shé huì shuōhuà!",
            "Dòngwùyuán lǐ de rén dōu zài jiān jiào.",
            "Shé màn man de pá zǒu le.",
            "Fúnán shūshu fēicháng shēngqì.",
            "Tā duì Hālì hǎn: \"Zhè shì nǐ gàn de!\"",
            "Hālì shuō: \"Wǒ bù zhīdào fāsheng le shénme.\"",
            "Dànshì méi rén xiāngxìn tā.",
            "Huí jiā hòu, Hālì bèi guān zài le lóutī xià de xiǎo fángjiān lǐ.",
            "Tā tǎng zài chuáng shàng xiǎng: \"Wèishénme qíguài de shì zǒng shì fāsheng zài wǒ shēnshang?\""
        ],
        "english": [
            "The Strange Incident at the Zoo (HP)",
            "Today is Dudley's birthday.",
            "Dudley wants to go to the zoo.",
            "Uncle Vernon says: \"Okay, we'll all go.\"",
            "Aunt Petunia asks: \"What about Harry?\"",
            "Uncle Vernon says unhappily: \"He has to come too.\"",
            "Harry is surprised, he has never been to a zoo before.",
            "They drive to the zoo.",
            "Dudley and his friend Piers are excited.",
            "Harry walks behind, very quiet.",
            "They first go to see the elephants.",
            "Dudley says: \"This elephant is so boring.\"",
            "Then they go to the reptile house.",
            "It's dark and cool inside.",
            "Harry sees a big snake.",
            "The snake is asleep, not moving at all.",
            "Dudley says: \"Make it move!\"",
            "Uncle Vernon taps on the glass, but the snake still doesn't move.",
            "Dudley walks away, feeling bored.",
            "Harry stands in front of the glass, looking at the snake.",
            "Suddenly, the snake opens its eyes.",
            "The snake slowly raises its head, looking at Harry.",
            "Harry finds it strange and says to the snake: \"Hello.\"",
            "Even stranger, the snake nods its head.",
            "Harry says again: \"Where are you from?\"",
            "The snake points its tail at a sign.",
            "The sign says: \"Boa Constrictor, Brazil\".",
            "At this moment, Dudley shouts: \"Look! The snake is moving!\"",
            "He pushes Harry away and presses against the glass to look.",
            "Harry gets angry and glares at Dudley.",
            "Suddenly, the glass disappears!",
            "Dudley falls into the snake's pool.",
            "The snake crawls out, passing by Harry.",
            "The snake says: \"Thank you, friend.\"",
            "Harry is startled, the snake can talk!",
            "People in the zoo are all screaming.",
            "The snake slowly crawls away.",
            "Uncle Vernon is very angry.",
            "He shouts at Harry: \"You did this!\"",
            "Harry says: \"I don't know what happened.\"",
            "But no one believes him.",
            "After returning home, Harry is locked in the small room under the stairs.",
            "He lies on the bed thinking: \"Why do strange things always happen to me?\""
        ]
    },
    "story_003": {
        "hanzi": [
            "国王十字车站",
            "今天是九月一号。",
            "哈利要去霍格沃茨学校。",
            "他和海格一起来到国王十字车站。",
            "海格说：\"你要去九又四分之三站台。\"",
            "哈利不明白：\"九又四分之三？那是什么？\"",
            "海格看看表：\"哎呀，我要走了。你自己去吧。\"",
            "哈利一个人推着行李车。",
            "他看到了九号和十号站台。",
            "但是没有九又四分之三号。",
            "哈利很着急，不知道该怎么办。",
            "这时，他听到有人说：\"麻瓜站台总是很多人。\"",
            "哈利转身看。",
            "他看到一家人，都有红头发。",
            "妈妈对孩子们说：\"好了，珀西你先走。\"",
            "一个大男孩推着车向墙走去。",
            "哈利眨眨眼，男孩不见了！",
            "哈利觉得很神奇。",
            "他鼓起勇气，走到那家人面前。",
            "哈利问：\"请问，我怎么去九又四分之三站台？\"",
            "妈妈很友好：\"第一次去霍格沃茨吗？\"",
            "哈利点点头。",
            "妈妈说：\"不用怕。你看罗恩，他也是第一次。\"",
            "一个男孩向哈利笑笑。",
            "妈妈指着墙说：\"你要跑向那堵墙。\"",
            "哈利觉得很奇怪：\"跑向墙？\"",
            "妈妈说：\"对。别怕，跑起来就行。\"",
            "哈利深吸一口气。",
            "他推着车，开始跑。",
            "墙越来越近，哈利闭上眼睛。",
            "他以为会撞到墙上。",
            "但是什么也没发生。",
            "哈利睁开眼睛。",
            "他看到一辆红色的火车。",
            "站台上写着：\"九又四分之三\"。",
            "哈利高兴极了。",
            "他终于找到了去霍格沃茨的路。",
            "火车很快就要开了。",
            "哈利赶紧上了车。",
            "他找到一个空座位坐下。",
            "哈利看着窗外想：\"新的生活要开始了。\""
        ],
        "pinyin": [
            "Guówáng shízì chēzhàn",
            "Jīntiān shì jiǔ yuè yī hào.",
            "Hālì yào qù Huògéwòcí xuéxiào.",
            "Tā hé Hǎigé yīqǐ lái dào Guówáng shízì chēzhàn.",
            "Hǎigé shuō: \"Nǐ yào qù jiǔ yòu sì fēn zhī sān zhàntái.\"",
            "Hālì bù míngbai: \"Jiǔ yòu sì fēn zhī sān? Nà shì shénme?\"",
            "Hǎigé kàn kan biǎo: \"Āiyā, wǒ yào zǒu le. Nǐ zìjǐ qù ba.\"",
            "Hālì yī gè rén tuī zhe xínglǐ chē.",
            "Tā kàn dào le jiǔ hào hé shí hào zhàntái.",
            "Dànshì méiyǒu jiǔ yòu sì fēn zhī sān hào.",
            "Hālì hěn zháojí, bù zhīdào gāi zěnme bàn.",
            "Zhè shí, tā tīng dào yǒu rén shuō: \"Mófang zhàntái zǒng shì hěn duō rén.\"",
            "Hālì zhuǎnshēn kàn.",
            "Tā kàn dào yī jiā rén, dōu yǒu hóng tóufa.",
            "Māma duì háizi men shuō: \"Hǎo le, Pòxī nǐ xiān zǒu.\"",
            "Yī gè dà nánhái tuī zhe chē xiàng qiáng zǒu qù.",
            "Hālì zhǎ zhǎ yǎn, nánhái bú jiàn le!",
            "Hālì juéde hěn shénqí.",
            "Tā gǔ qǐ yǒngqì, zǒu dào nà jiā rén miànqián.",
            "Hālì wèn: \"Qǐngwèn, wǒ zěnme qù jiǔ yòu sì fēn zhī sān zhàntái?\"",
            "Māma hěn yǒuhǎo: \"Dì yī cì qù Huògéwòcí ma?\"",
            "Hālì diǎn diǎn tóu.",
            "Māma shuō: \"Bú yòng pà. Nǐ kàn Luōén, tā yě shì dì yī cì.\"",
            "Yī gè nánhái xiàng Hālì xiào xiào.",
            "Māma zhǐ zhe qiáng shuō: \"Nǐ yào pǎo xiàng nà dǔ qiáng.\"",
            "Hālì juéde hěn qíguài: \"Pǎo xiàng qiáng?\"",
            "Māma shuō: \"Duì. Bié pà, pǎo qǐlai jiù xíng.\"",
            "Hālì shēn xī yī kǒu qì.",
            "Tā tuī zhe chē, kāishǐ pǎo.",
            "Qiáng yuè lái yuè jìn, Hālì bì shàng yǎnjing.",
            "Tā yǐwéi huì zhuàng dào qiáng shàng.",
            "Dànshì shénme yě méi fāshēng.",
            "Hālì zhēng kāi yǎnjing.",
            "Tā kàn dào yī liàng hóngsè de huǒchē.",
            "Zhàntái shàng xiě zhe: \"Jiǔ yòu sì fēn zhī sān\".",
            "Hālì gāoxìng jí le.",
            "Tā zhōngyú zhǎo dào le qù Huògéwòcí de lù.",
            "Huǒchē hěn kuài jiù yào kāi le.",
            "Hālì gǎnjǐn shàng le chē.",
            "Tā zhǎo dào yī gè kōng zuòwèi zuò xià.",
            "Hālì kàn zhe chuāng wài xiǎng: \"Xīn de shēnghuó yào kāishǐ le.\""
        ],
        "english": [
            "King's Cross Station (HP)",
            "Today is September 1st.",
            "Harry is going to Hogwarts School.",
            "He comes to King's Cross Station with Hagrid.",
            "Hagrid says: \"You need to go to Platform Nine and Three-Quarters.\"",
            "Harry doesn't understand: \"Nine and Three-Quarters? What's that?\"",
            "Hagrid looks at his watch: \"Oh no, I have to go. You go by yourself.\"",
            "Harry pushes the luggage cart alone.",
            "He sees Platform Nine and Platform Ten.",
            "But there's no Platform Nine and Three-Quarters.",
            "Harry is worried, he doesn't know what to do.",
            "Then, he hears someone say: \"The Muggle platform is always so crowded.\"",
            "Harry turns to look.",
            "He sees a family, all with red hair.",
            "The mother says to the children: \"Alright, Percy, you go first.\"",
            "A big boy pushes his cart towards the wall.",
            "Harry blinks, and the boy is gone!",
            "Harry finds it amazing.",
            "He gathers courage and walks up to the family.",
            "Harry asks: \"Excuse me, how do I get to Platform Nine and Three-Quarters?\"",
            "The mother is friendly: \"First time to Hogwarts?\"",
            "Harry nods.",
            "The mother says: \"Don't be afraid. Look at Ron, it's his first time too.\"",
            "A boy smiles at Harry.",
            "The mother points at the wall and says: \"You need to run towards that wall.\"",
            "Harry finds it strange: \"Run towards the wall?\"",
            "The mother says: \"Yes. Don't be afraid, just run.\"",
            "Harry takes a deep breath.",
            "He pushes the cart and starts running.",
            "The wall gets closer and closer, Harry closes his eyes.",
            "He thinks he will crash into the wall.",
            "But nothing happens.",
            "Harry opens his eyes.",
            "He sees a red train.",
            "The platform sign reads: \"Nine and Three-Quarters\".",
            "Harry is very happy.",
            "He has finally found the way to Hogwarts.",
            "The train is about to leave.",
            "Harry quickly gets on the train.",
            "He finds an empty seat and sits down.",
            "Harry looks out the window and thinks: \"A new life is about to begin.\""
        ]
    },
    "grammar_001": {
        "name": "是...的 (shì...de)",
        "description": "Used to emphasize certain aspects of a past action",
        "hanzi": [
            "是...的 (shì...de)",
            "我是昨天去的商店。",
            "他是坐飞机来的中国。",
            "我们是在学校认识的。",
            "她是去年毕业的。",
            "这本书是我朋友送的。",
            "我是走路去上班的。",
            "他们是在北京结婚的。",
            "这件衣服是妈妈做的。",
            "我是用中文写的信。",
            "他是自己学会的游泳。"
        ],
        "pinyin": [
            "Shì...de",
            "Wǒ shì zuótiān qù de shāngdiàn.",
            "Tā shì zuò fēijī lái de Zhōngguó.",
            "Wǒmen shì zài xuéxiào rènshi de.",
            "Tā shì qùnián bìyè de.",
            "Zhè běn shū shì wǒ péngyou sòng de.",
            "Wǒ shì zǒulù qù shàngbān de.",
            "Tāmen shì zài Běijīng jiéhūn de.",
            "Zhè jiàn yīfu shì māma zuò de.",
            "Wǒ shì yòng Zhōngwén xiě de xìn.",
            "Tā shì zìjǐ xuéhuì de yóuyǒng."
        ],
        "english": [
            "是...的 (shì...de)",
            "It was yesterday that I went to the store.",
            "It was by plane that he came to China.",
            "It was at school that we met.",
            "It was last year that she graduated.",
            "This book was given by my friend.",
            "It was by walking that I went to work.",
            "It was in Beijing that they got married.",
            "This clothes were made by my mother.",
            "It was in Chinese that I wrote the letter.",
            "It was by himself that he learned to swim."
        ]
    },
    "grammar_002": {
        "name": "Verb + 了 (le)",
        "description": "Indicates completion of an action",
        "hanzi": [
            "Verb + 了 (le)",
            "我吃了早饭。",
            "他看了一本书。",
            "我们去了公园。",
            "她买了新衣服。",
            "我学了中文。",
            "他们回家了。",
            "火车到站了。",
            "天黑了。",
            "我认识了新朋友。",
            "他打电话了。"
        ],
        "pinyin": [
            "Dòngcí + le",
            "Wǒ chī le zǎofàn.",
            "Tā kàn le yī běn shū.",
            "Wǒmen qù le gōngyuán.",
            "Tā mǎi le xīn yīfu.",
            "Wǒ xué le Zhōngwén.",
            "Tāmen huí jiā le.",
            "Huǒchē dào zhàn le.",
            "Tiān hēi le.",
            "Wǒ rènshi le xīn péngyou.",
            "Tā dǎ diànhuà le."
        ],
        "english": [
            "Verb + 了 (le)",
            "I ate breakfast.",
            "He read a book.",
            "We went to the park.",
            "She bought new clothes.",
            "I learned Chinese.",
            "They went home.",
            "The train arrived at the station.",
            "It got dark.",
            "I made new friends.",
            "He made a phone call."
        ]
    },
    "grammar_003": {
        "name": "在 + place + Verb",
        "description": "Indicates an action happening in a specific place",
        "hanzi": [
            "在 + place + Verb",
            "我在家学习。",
            "他在公园跑步。",
            "她在学校吃午饭。",
            "我们在图书馆看书。",
            "他们在餐厅聊天。",
            "小猫在沙发上睡觉。",
            "老师在教室里讲课。",
            "妈妈在厨房做饭。",
            "爸爸在办公室工作。",
            "孩子们在操场上玩耍。"
        ],
        "pinyin": [
            "Zài + dìfang + dòngcí",
            "Wǒ zài jiā xuéxí.",
            "Tā zài gōngyuán pǎobù.",
            "Tā zài xuéxiào chī wǔfàn.",
            "Wǒmen zài túshūguǎn kàn shū.",
            "Tāmen zài cāntīng liáotiān.",
            "Xiǎo māo zài shāfā shàng shuìjiào.",
            "Lǎoshī zài jiàoshì lǐ jiǎngkè.",
            "Māma zài chúfáng zuòfàn.",
            "Bàba zài bàngōngshì gōngzuò.",
            "Háizi men zài cāochǎng shàng wánshuǎ."
        ],
        "english": [
            "在 + place + Verb",
            "I study at home.",
            "He runs in the park.",
            "She eats lunch at school.",
            "We read books in the library.",
            "They chat in the restaurant.",
            "The kitten sleeps on the sofa.",
            "The teacher gives a lecture in the classroom.",
            "Mom cooks in the kitchen.",
            "Dad works in the office.",
            "The children play on the playground."
        ]
    },
    "grammar_004": {
        "name": "正在 + Verb",
        "description": "Indicates an action in progress",
        "hanzi": [
            "正在 + Verb",
            "我正在看电视。",
            "他们正在开会。",
            "妈妈正在做饭。",
            "老师正在讲课。",
            "小狗正在睡觉。",
            "我们正在学中文。",
            "她正在打电话。",
            "爸爸正在洗车。",
            "孩子们正在玩游戏。",
            "我正在写作业。"
        ],
        "pinyin": [
            "Zhèngzài + dòngcí",
            "Wǒ zhèngzài kàn diànshì.",
            "Tāmen zhèngzài kāihuì.",
            "Māma zhèngzài zuòfàn.",
            "Lǎoshī zhèngzài jiǎngkè.",
            "Xiǎo gǒu zhèngzài shuìjiào.",
            "Wǒmen zhèngzài xué Zhōngwén.",
            "Tā zhèngzài dǎ diànhuà.",
            "Bàba zhèngzài xǐ chē.",
            "Háizi men zhèngzài wán yóuxì.",
            "Wǒ zhèngzài xiě zuòyè."
        ],
        "english": [
            "正在 + Verb",
            "I am watching TV.",
            "They are having a meeting.",
            "Mom is cooking.",
            "The teacher is giving a lecture.",
            "The puppy is sleeping.",
            "We are learning Chinese.",
            "She is making a phone call.",
            "Dad is washing the car.",
            "The children are playing games.",
            "I am doing homework."
        ]
    },
    "grammar_005": {
        "name": "Verb + 着 (zhe)",
        "description": "Describes a continuous state",
        "hanzi": [
            "Verb + 着 (zhe)",
            "门开着。",
            "他站着看书。",
            "墙上挂着一幅画。",
            "桌子上放着一本书。",
            "她笑着说话。",
            "我们坐着聊天。",
            "小猫睡着了。",
            "电视开着。",
            "窗户关着。",
            "他穿着新衣服。"
        ],
        "pinyin": [
            "Dòngcí + zhe",
            "Mén kāizhe.",
            "Tā zhànzhe kàn shū.",
            "Qiáng shàng guàzhe yī fú huà.",
            "Zhuōzi shàng fàngzhe yī běn shū.",
            "Tā xiàozhe shuōhuà.",
            "Wǒmen zuòzhe liáotiān.",
            "Xiǎo māo shuìzhe le.",
            "Diànshì kāizhe.",
            "Chuānghu guānzhe.",
            "Tā chuānzhe xīn yīfu."
        ],
        "english": [
            "Verb + 着 (zhe)",
            "The door is open.",
            "He is standing and reading a book.",
            "A painting is hanging on the wall.",
            "A book is placed on the table.",
            "She speaks with a smile.",
            "We are sitting and chatting.",
            "The kitten has fallen asleep.",
            "The TV is on.",
            "The window is closed.",
            "He is wearing new clothes."
        ]
    },
    "grammar_006": {
        "name": "很 / 太 / 非常 + Adjective",
        "description": "Intensifiers for adjectives",
        "hanzi": [
            "很 / 太 / 非常 + Adjective",
            "这个苹果很甜。",
            "今天太热了。",
            "他的中文说得非常好。",
            "这个问题很难。",
            "那个电影太长了。",
            "她唱歌非常好听。",
            "这里的风景很美。",
            "这本书太有意思了。",
            "他跑得非常快。",
            "我今天很忙。"
        ],
        "pinyin": [
            "Hěn / tài / fēicháng + xíngróngcí",
            "Zhè gè píngguǒ hěn tián.",
            "Jīntiān tài rè le.",
            "Tā de Zhōngwén shuō de fēicháng hǎo.",
            "Zhè ge wèntí hěn nán.",
            "Nà ge diànyǐng tài cháng le.",
            "Tā chànggē fēicháng hǎotīng.",
            "Zhèlǐ de fēngjǐng hěn měi.",
            "Zhè běn shū tài yǒuyìsi le.",
            "Tā pǎo de fēicháng kuài.",
            "Wǒ jīntiān hěn máng."
        ],
        "english": [
            "很 / 太 / 非常 + Adjective",
            "This apple is very sweet.",
            "It's too hot today.",
            "He speaks Chinese extremely well.",
            "This question is very difficult.",
            "That movie is too long.",
            "She sings extremely well.",
            "The scenery here is very beautiful.",
            "This book is too interesting.",
            "He runs extremely fast.",
            "I'm very busy today."
        ]
    },
    "grammar_007": {
        "name": "比 + Noun + Adjective",
        "description": "Comparative structure",
        "hanzi": [
            "比 + Noun + Adjective",
            "我比他高。",
            "这本书比那本贵。",
            "今天比昨天冷。",
            "火车比汽车快。",
            "哥哥比我大两岁。",
            "中文比英文难。",
            "这个城市比那个城市大。",
            "苹果比香蕉便宜。",
            "他比我聪明。",
            "夏天比冬天热。"
        ],
        "pinyin": [
            "Bǐ + míngcí + xíngróngcí",
            "Wǒ bǐ tā gāo.",
            "Zhè běn shū bǐ nà běn guì.",
            "Jīntiān bǐ zuótiān lěng.",
            "Huǒchē bǐ qìchē kuài.",
            "Gēge bǐ wǒ dà liǎng suì.",
            "Zhōngwén bǐ Yīngwén nán.",
            "Zhège chéngshì bǐ nàge chéngshì dà.",
            "Píngguǒ bǐ xiāngjiāo piányi.",
            "Tā bǐ wǒ cōngming.",
            "Xiàtiān bǐ dōngtiān rè."
        ],
        "english": [
            "比 + Noun + Adjective",
            "I am taller than him.",
            "This book is more expensive than that one.",
            "Today is colder than yesterday.",
            "Trains are faster than cars.",
            "My older brother is two years older than me.",
            "Chinese is harder than English.",
            "This city is bigger than that city.",
            "Apples are cheaper than bananas.",
            "He is smarter than me.",
            "Summer is hotter than winter."
        ]
    },
    "grammar_008": {
        "name": "和...一起",
        "description": "Together with...",
        "hanzi": [
            "和...一起",
            "我和朋友一起去电影院。",
            "他和妹妹一起学习。",
            "我们和老师一起吃午饭。",
            "她和家人一起旅游。",
            "孩子们和爸爸一起玩游戏。",
            "我和同学一起做作业。",
            "他和女朋友一起看日出。",
            "我们和邻居一起种花。",
            "小明和小红一起走路去学校。",
            "妈妈和我一起做饭。"
        ],
        "pinyin": [
            "Hé...yīqǐ",
            "Wǒ hé péngyou yīqǐ qù diànyǐngyuàn.",
            "Tā hé mèimei yīqǐ xuéxí.",
            "Wǒmen hé lǎoshī yīqǐ chī wǔfàn.",
            "Tā hé jiārén yīqǐ lǚyóu.",
            "Háizimen hé bàba yīqǐ wán yóuxì.",
            "Wǒ hé tóngxué yīqǐ zuò zuòyè.",
            "Tā hé nǚpéngyou yīqǐ kàn rìchū.",
            "Wǒmen hé línjū yīqǐ zhòng huā.",
            "Xiǎo Míng hé Xiǎo Hóng yīqǐ zǒulù qù xuéxiào.",
            "Māma hé wǒ yīqǐ zuò fàn."
        ],
        "english": [
            "Together with...",
            "I go to the cinema together with my friend.",
            "He studies together with his younger sister.",
            "We eat lunch together with the teacher.",
            "She travels together with her family.",
            "The children play games together with their dad.",
            "I do homework together with my classmate.",
            "He watches the sunrise together with his girlfriend.",
            "We plant flowers together with our neighbors.",
            "Xiao Ming and Xiao Hong walk to school together.",
            "Mom and I cook together."
        ]
    },
    "grammar_009": {
        "name": "又...又...",
        "description": "Both... and...",
        "hanzi": [
            "又...又...",
            "这本书又便宜又有趣。",
            "他又聪明又勤奋。",
            "这个城市又大又美。",
            "今天的天气又冷又阴。",
            "这家餐厅的菜又好吃又便宜。",
            "她又漂亮又善良。",
            "这部电影又长又无聊。",
            "这个工作又轻松又有趣。",
            "这个房间又干净又整齐。",
            "这个问题又简单又重要。"
        ],
        "pinyin": [
            "Yòu...yòu...",
            "Zhè běn shū yòu piányi yòu yǒuqù.",
            "Tā yòu cōngming yòu qínfèn.",
            "Zhège chéngshì yòu dà yòu měi.",
            "Jīntiān de tiānqì yòu lěng yòu yīn.",
            "Zhè jiā cāntīng de cài yòu hǎochī yòu piányi.",
            "Tā yòu piàoliang yòu shànliáng.",
            "Zhè bù diànyǐng yòu cháng yòu wúliáo.",
            "Zhège gōngzuò yòu qīngsōng yòu yǒuqù.",
            "Zhège fángjiān yòu gānjìng yòu zhěngqí.",
            "Zhège wèntí yòu jiǎndān yòu zhòngyào."
        ],
        "english": [
            "Both... and...",
            "This book is both cheap and interesting.",
            "He is both smart and diligent.",
            "This city is both big and beautiful.",
            "Today's weather is both cold and cloudy.",
            "The food in this restaurant is both delicious and cheap.",
            "She is both beautiful and kind.",
            "This movie is both long and boring.",
            "This job is both relaxing and interesting.",
            "This room is both clean and tidy.",
            "This question is both simple and important."
        ]
    },
    "grammar_010": {
        "name": "虽然...但是...",
        "description": "Although... but...",
        "hanzi": [
            "虽然...但是...",
            "虽然下雨了，但是我们还是去公园了。",
            "虽然他很忙，但是他还是来参加了我的生日派对。",
            "虽然这本书很贵，但是内容很好。",
            "虽然我不会说中文，但是我很喜欢中国文化。",
            "虽然现在很晚了，但是我还得工作。",
            "虽然他年纪小，但是很有才华。",
            "虽然这道菜看起来不怎么样，但是味道很好。",
            "虽然我们是竞争对手，但是我们还是好朋友。",
            "虽然这个城市很大，但是空气很好。",
            "虽然他脾气不好，但是工作能力很强。"
        ],
        "pinyin": [
            "Suīrán... dànshì...",
            "Suīrán xià yǔ le, dànshì wǒmen háishi qù gōngyuán le.",
            "Suīrán tā hěn máng, dànshì tā háishi lái cānjiā le wǒ de shēngrì pàiduì.",
            "Suīrán zhè běn shū hěn guì, dànshì nèiróng hěn hǎo.",
            "Suīrán wǒ bú huì shuō Zhōngwén, dànshì wǒ hěn xǐhuan Zhōngguó wénhuà.",
            "Suīrán xiànzài hěn wǎn le, dànshì wǒ hái děi gōngzuò.",
            "Suīrán tā niánjì xiǎo, dànshì hěn yǒu cáihuá.",
            "Suīrán zhè dào cài kàn qǐlái bù zěnmeyàng, dànshì wèidao hěn hǎo.",
            "Suīrán wǒmen shì jìngzhēng duìshǒu, dànshì wǒmen háishi hǎo péngyou.",
            "Suīrán zhège chéngshì hěn dà, dànshì kōngqì hěn hǎo.",
            "Suīrán tā píqi bù hǎo, dànshì gōngzuò nénglì hěn qiáng."
        ],
        "english": [
            "Although... but...",
            "Although it was raining, we still went to the park.",
            "Although he was very busy, he still came to my birthday party.",
            "Although this book is expensive, the content is very good.",
            "Although I can't speak Chinese, I really like Chinese culture.",
            "Although it's very late now, I still have to work.",
            "Although he's young, he's very talented.",
            "Although this dish doesn't look great, it tastes very good.",
            "Although we are competitors, we are still good friends.",
            "Although this city is very big, the air quality is good.",
            "Although he has a bad temper, his work ability is very strong."
        ]
    },
    "grammar_011": {
        "name": "因为...所以...",
        "description": "Because... therefore...",
        "hanzi": [
            "因为...所以...",
            "因为下雨了，所以我们取消了野餐。",
            "因为他生病了，所以没来上课。",
            "因为我很喜欢中国文化，所以我开始学习中文。",
            "因为火车晚点了，所以我迟到了。",
            "因为他工作认真，所以获得了升职。",
            "因为天气很热，所以我们决定去游泳。",
            "因为这本书很有趣，所以我一口气读完了。",
            "因为他们是好朋友，所以经常一起出去玩。",
            "因为我忘了带钱包，所以不能买东西。",
            "因为她很擅长烹饪，所以常常被邀请做饭。"
        ],
        "pinyin": [
            "Yīnwèi... suǒyǐ...",
            "Yīnwèi xià yǔ le, suǒyǐ wǒmen qǔxiāo le yěcān.",
            "Yīnwèi tā shēngbìng le, suǒyǐ méi lái shàngkè.",
            "Yīnwèi wǒ hěn xǐhuan Zhōngguó wénhuà, suǒyǐ wǒ kāishǐ xuéxí Zhōngwén.",
            "Yīnwèi huǒchē wǎndiǎn le, suǒyǐ wǒ chídào le.",
            "Yīnwèi tā gōngzuò rènzhēn, suǒyǐ huòdé le shēngzhí.",
            "Yīnwèi tiānqì hěn rè, suǒyǐ wǒmen juédìng qù yóuyǒng.",
            "Yīnwèi zhè běn shū hěn yǒuqù, suǒyǐ wǒ yī kǒuqì dú wán le.",
            "Yīnwèi tāmen shì hǎo péngyou, suǒyǐ jīngcháng yīqǐ chūqù wán.",
            "Yīnwèi wǒ wàng le dài qiánbāo, suǒyǐ bù néng mǎi dōngxi.",
            "Yīnwèi tā hěn shàncháng pēngrèn, suǒyǐ chángcháng bèi yāoqǐng zuò fàn."
        ],
        "english": [
            "Because... therefore...",
            "Because it was raining, we canceled the picnic.",
            "Because he was sick, he didn't come to class.",
            "Because I really like Chinese culture, I started learning Chinese.",
            "Because the train was late, I arrived late.",
            "Because he works diligently, he got promoted.",
            "Because the weather is very hot, we decided to go swimming.",
            "Because this book is very interesting, I read it in one go.",
            "Because they are good friends, they often go out together.",
            "Because I forgot to bring my wallet, I can't buy anything.",
            "Because she is good at cooking, she is often invited to cook."
        ]
    },
    "grammar_012": {
        "name": "不但...而且...",
        "description": "Not only... but also...",
        "hanzi": [
            "不但...而且...",
            "他不但会说中文，而且会说日语。",
            "这家餐厅不但菜很好吃，而且价格也很合理。",
            "她不但长得漂亮，而且性格也很好。",
            "这本书不但内容丰富，而且写得很有趣。",
            "他不但是个好老师，而且还是个好朋友。",
            "这个城市不但很美，而且很安全。",
            "这部电影不但故事精彩，而且特效也很棒。",
            "这个工作不但薪水高，而且还有很多福利。",
            "她不但学习成绩好，而且还很擅长运动。",
            "这个房子不但地理位置好，而且价格也很合适。"
        ],
        "pinyin": [
            "Bùdàn... érqiě...",
            "Tā bùdàn huì shuō Zhōngwén, érqiě huì shuō Rìyǔ.",
            "Zhè jiā cāntīng bùdàn cài hěn hǎochī, érqiě jiàgé yě hěn hélǐ.",
            "Tā bùdàn zhǎng de piàoliang, érqiě xìnggé yě hěn hǎo.",
            "Zhè běn shū bùdàn nèiróng fēngfù, érqiě xiě de hěn yǒuqù.",
            "Tā bùdàn shì ge hǎo lǎoshī, érqiě hái shì ge hǎo péngyou.",
            "Zhège chéngshì bùdàn hěn měi, érqiě hěn ānquán.",
            "Zhè bù diànyǐng bùdàn gùshi jīngcǎi, érqiě tèxiào yě hěn bàng.",
            "Zhège gōngzuò bùdàn xīnshui gāo, érqiě hái yǒu hěnduō fúlì.",
            "Tā bùdàn xuéxí chéngjì hǎo, érqiě hái hěn shàncháng yùndòng.",
            "Zhège fángzi bùdàn dìlǐ wèizhi hǎo, érqiě jiàgé yě hěn héshì."
        ],
        "english": [
            "Not only... but also...",
            "He not only speaks Chinese, but also Japanese.",
            "This restaurant not only has delicious food, but also reasonable prices.",
            "She is not only beautiful, but also has a good personality.",
            "This book is not only rich in content, but also written in an interesting way.",
            "He is not only a good teacher, but also a good friend.",
            "This city is not only beautiful, but also safe.",
            "This movie not only has a great story, but also excellent special effects.",
            "This job not only has a high salary, but also many benefits.",
            "She not only has good grades, but is also good at sports.",
            "This house not only has a good location, but also a suitable price."
        ]
    },
    "grammar_013": {
        "name": "想 + Verb",
        "description": "Want to... or Would like to...",
        "hanzi": [
            "想 + Verb",
            "我想去中国旅游。",
            "他想学习日语。",
            "我们想吃中国菜。",
            "她想买一台新电脑。",
            "我想认识新朋友。",
            "他们想参加这个活动。",
            "我想问你一个问题。",
            "她想找一份新工作。",
            "我想尝试这道菜。",
            "他想和你谈谈。"
        ],
        "pinyin": [
            "Xiǎng + dòngcí",
            "Wǒ xiǎng qù Zhōngguó lǚyóu.",
            "Tā xiǎng xuéxí Rìyǔ.",
            "Wǒmen xiǎng chī Zhōngguó cài.",
            "Tā xiǎng mǎi yī tái xīn diànnǎo.",
            "Wǒ xiǎng rènshi xīn péngyou.",
            "Tāmen xiǎng cānjiā zhège huódòng.",
            "Wǒ xiǎng wèn nǐ yīge wèntí.",
            "Tā xiǎng zhǎo yī fèn xīn gōngzuò.",
            "Wǒ xiǎng chángshì zhè dào cài.",
            "Tā xiǎng hé nǐ tántan."
        ],
        "english": [
            "Want to... or Would like to...",
            "I want to travel to China.",
            "He wants to learn Japanese.",
            "We would like to eat Chinese food.",
            "She wants to buy a new computer.",
            "I want to meet new friends.",
            "They want to participate in this activity.",
            "I would like to ask you a question.",
            "She wants to find a new job.",
            "I want to try this dish.",
            "He wants to talk with you."
        ]
    },
    "grammar_014": {
        "name": "会 / 能 / 可以 + Verb",
        "description": "Different ways to express ability or permission",
        "hanzi": [
            "会 / 能 / 可以 + Verb",
            "我会说中文。",
            "他能游泳。",
            "你可以坐在这里。",
            "她会弹钢琴。",
            "我能帮你吗？",
            "你可以借我的书。",
            "他会开车。",
            "我们能进去参观吗？",
            "你可以用我的电脑。",
            "她会做很多中国菜。"
        ],
        "pinyin": [
            "Huì / néng / kěyǐ + dòngcí",
            "Wǒ huì shuō Zhōngwén.",
            "Tā néng yóuyǒng.",
            "Nǐ kěyǐ zuò zài zhèlǐ.",
            "Tā huì tán gāngqín.",
            "Wǒ néng bāng nǐ ma?",
            "Nǐ kěyǐ jiè wǒ de shū.",
            "Tā huì kāi chē.",
            "Wǒmen néng jìnqù cānguān ma?",
            "Nǐ kěyǐ yòng wǒ de diànnǎo.",
            "Tā huì zuò hěnduō Zhōngguó cài."
        ],
        "english": [
            "Can / Be able to / May + Verb",
            "I can speak Chinese.",
            "He can swim.",
            "You may sit here.",
            "She can play the piano.",
            "Can I help you?",
            "You can borrow my book.",
            "He can drive.",
            "Can we go in and visit?",
            "You may use my computer.",
            "She can make many Chinese dishes."
        ]
    },
    "grammar_015": {
        "name": "好 + Adjective",
        "description": "Easy to...",
        "hanzi": [
            "好 + Adjective",
            "这本书很好读。",
            "这个问题很好解决。",
            "这个电影很好看。",
            "这道菜很好吃。",
            "这个游戏很好玩。",
            "这首歌很好听。",
            "这个题很好回答。",
            "这件衣服很好洗。",
            "这个软件很好用。",
            "这个故事很好记。"
        ],
        "pinyin": [
            "Hǎo + xíngróngcí",
            "Zhè běn shū hěn hǎo dú.",
            "Zhège wèntí hěn hǎo jiějué.",
            "Zhège diànyǐng hěn hǎokàn.",
            "Zhè dào cài hěn hǎochī.",
            "Zhège yóuxì hěn hǎowán.",
            "Zhè shǒu gē hěn hǎotīng.",
            "Zhège tí hěn hǎo huídá.",
            "Zhè jiàn yīfu hěn hǎo xǐ.",
            "Zhège ruǎnjiàn hěn hǎoyòng.",
            "Zhège gùshi hěn hǎo jì."
        ],
        "english": [
            "Easy to...",
            "This book is easy to read.",
            "This problem is easy to solve.",
            "This movie is enjoyable to watch.",
            "This dish is delicious (easy to eat).",
            "This game is fun to play.",
            "This song is pleasant to listen to.",
            "This question is easy to answer.",
            "This clothes are easy to wash.",
            "This software is easy to use.",
            "This story is easy to remember."
        ]
    },
    "grammar_016": {
        "name": "多 / 少 + Verb",
        "description": "How much or how many questions",
        "hanzi": [
            "多 / 少 + Verb",
            "你一天工作多长时间？",
            "这本书多少钱？",
            "你有多少朋友？",
            "他每天看多长时间的电视？",
            "你家离这里多远？",
            "这个城市有多少人口？",
            "你一个月赚多少钱？",
            "你每天睡多长时间？",
            "这个包裹有多重？",
            "你学中文学了多长时间？"
        ],
        "pinyin": [
            "Duō / shǎo + dòngcí",
            "Nǐ yī tiān gōngzuò duō cháng shíjiān?",
            "Zhè běn shū duōshao qián?",
            "Nǐ yǒu duōshao péngyou?",
            "Tā měitiān kàn duō cháng shíjiān de diànshì?",
            "Nǐ jiā lí zhèlǐ duō yuǎn?",
            "Zhège chéngshì yǒu duōshao rénkǒu?",
            "Nǐ yī ge yuè zuàn duōshao qián?",
            "Nǐ měitiān shuì duō cháng shíjiān?",
            "Zhège bāoguǒ yǒu duō zhòng?",
            "Nǐ xué Zhōngwén xué le duō cháng shíjiān?"
        ],
        "english": [
            "How much or how many questions",
            "How many hours do you work in a day?",
            "How much does this book cost?",
            "How many friends do you have?",
            "How long does he watch TV every day?",
            "How far is your home from here?",
            "What is the population of this city?",
            "How much money do you earn in a month?",
            "How long do you sleep every day?",
            "How heavy is this package?",
            "How long have you been learning Chinese?"
        ]
    },
    "grammar_017": {
        "name": "一边...一边...",
        "description": "While... (doing two actions simultaneously)",
        "hanzi": [
            "一边...一边...",
            "他一边走路一边听音乐。",
            "我一边做作业一边看电视。",
            "她一边吃饭一边看手机。",
            "他们一边聊天一边喝咖啡。",
            "我一边开车一边唱歌。",
            "妈妈一边做饭一边照顾孩子。",
            "他一边跑步一边听播客。",
            "我们一边学习一边玩游戏。",
            "爸爸一边看报纸一边喝茶。",
            "她一边洗衣服一边听广播。"
        ],
        "pinyin": [
            "Yībiān... yībiān...",
            "Tā yībiān zǒulù yībiān tīng yīnyuè.",
            "Wǒ yībiān zuò zuòyè yībiān kàn diànshì.",
            "Tā yībiān chīfàn yībiān kàn shǒujī.",
            "Tāmen yībiān liáotiān yībiān hē kāfēi.",
            "Wǒ yībiān kāichē yībiān chànggē.",
            "Māma yībiān zuòfàn yībiān zhàogu háizi.",
            "Tā yībiān pǎobù yībiān tīng bōkè.",
            "Wǒmen yībiān xuéxí yībiān wán yóuxì.",
            "Bàba yībiān kàn bàozhǐ yībiān hē chá.",
            "Tā yībiān xǐ yīfu yībiān tīng guǎngbō."
        ],
        "english": [
            "While... (doing two actions simultaneously)",
            "He walks while listening to music.",
            "I do homework while watching TV.",
            "She eats while looking at her phone.",
            "They chat while drinking coffee.",
            "I drive while singing.",
            "Mom cooks while taking care of the children.",
            "He runs while listening to podcasts.",
            "We study while playing games.",
            "Dad reads the newspaper while drinking tea.",
            "She does laundry while listening to the radio."
        ]
    },
    "grammar_018": {
        "name": "从...到...",
        "description": "From... to... (indicating range)",
        "hanzi": [
            "从...到...",
            "商店从早上9点开到晚上10点。",
            "火车从北京到上海要5个小时。",
            "我从周一学习到周五。",
            "这本书从第一页精彩到最后一页。",
            "价格从10元到100元不等。",
            "他从头看到尾，一点也没漏。",
            "展览会从5月1日持续到5月7日。",
            "我们从大学认识到现在已经十年了。",
            "这条路从城市中心一直修到郊区。",
            "温度从零下5度上升到15度。"
        ],
        "pinyin": [
            "Cóng... dào...",
            "Shāngdiàn cóng zǎoshang 9 diǎn kāi dào wǎnshang 10 diǎn.",
            "Huǒchē cóng Běijīng dào Shànghǎi yào 5 ge xiǎoshí.",
            "Wǒ cóng zhōuyī xuéxí dào zhōuwǔ.",
            "Zhè běn shū cóng dì yī yè jīngcǎi dào zuìhòu yī yè.",
            "Jiàgé cóng 10 yuán dào 100 yuán bùděng.",
            "Tā cóng tóu kàn dào wěi, yīdiǎn yě méi lòu.",
            "Zhǎnlǎnhuì cóng 5 yuè 1 rì chíxù dào 5 yuè 7 rì.",
            "Wǒmen cóng dàxué rènshi dào xiànzài yǐjīng shí nián le.",
            "Zhè tiáo lù cóng chéngshì zhōngxīn yīzhí xiū dào jiāoqū.",
            "Wēndù cóng língxià 5 dù shēngshàng dào 15 dù."
        ],
        "english": [
            "From... to... (indicating range)",
            "The store is open from 9 AM to 10 PM.",
            "The train takes 5 hours from Beijing to Shanghai.",
            "I study from Monday to Friday.",
            "This book is exciting from the first page to the last.",
            "Prices range from 10 yuan to 100 yuan.",
            "He watched it from beginning to end, missing nothing.",
            "The exhibition lasts from May 1st to May 7th.",
            "We've known each other for ten years, from university until now.",
            "This road extends from the city center all the way to the suburbs.",
            "The temperature rose from -5 degrees to 15 degrees."
        ]
    },
    "grammar_019": {
        "name": "对...来说",
        "description": "As for... or Speaking of...",
        "hanzi": [
            "对...来说",
            "对我来说，学习中文很有趣。",
            "对孩子们来说，这个游戏太难了。",
            "对新手来说，这个工作可能有点儿困难。",
            "对老人来说，使用智能手机并不容易。",
            "对中国人来说，吃米饭是很平常的事。",
            "对外国人来说，中国的文化很有吸引力。",
            "对学生来说，这门课程很重要。",
            "对年轻人来说，找工作是一个挑战。",
            "对我们公司来说，客户满意度是最重要的。",
            "对运动员来说，保持健康的饮食很关键。"
        ],
        "pinyin": [
            "Duì... lái shuō",
            "Duì wǒ lái shuō, xuéxí Zhōngwén hěn yǒuqù.",
            "Duì háizimen lái shuō, zhège yóuxì tài nán le.",
            "Duì xīnshǒu lái shuō, zhège gōngzuò kěnéng yǒu diǎnr kùnnan.",
            "Duì lǎorén lái shuō, shǐyòng zhìnéng shǒujī bìng bù róngyì.",
            "Duì Zhōngguórén lái shuō, chī mǐfàn shì hěn píngcháng de shì.",
            "Duì wàiguórén lái shuō, Zhōngguó de wénhuà hěn yǒu xīyǐnlì.",
            "Duì xuésheng lái shuō, zhè mén kèchéng hěn zhòngyào.",
            "Duì niánqīngrén lái shuō, zhǎo gōngzuò shì yīge tiǎozhàn.",
            "Duì wǒmen gōngsī lái shuō, kèhù mǎnyìdù shì zuì zhòngyào de.",
            "Duì yùndòngyuán lái shuō, bǎochí jiànkāng de yǐnshí hěn guānjiàn."
        ],
        "english": [
            "As for... or Speaking of...",
            "As for me, learning Chinese is very interesting.",
            "For children, this game is too difficult.",
            "For beginners, this job might be a bit challenging.",
            "For the elderly, using smartphones is not easy.",
            "For Chinese people, eating rice is very common.",
            "For foreigners, Chinese culture is very attractive.",
            "For students, this course is very important.",
            "For young people, finding a job is a challenge.",
            "For our company, customer satisfaction is the most important.",
            "For athletes, maintaining a healthy diet is crucial."
        ]
    },
    "grammar_020": {
        "name": "有的...有的...",
        "description": "Some... others...",
        "hanzi": [
            "有的...有的...",
            "有的人喜欢咖啡，有的人喜欢茶。",
            "有的学生在教室里，有的学生在操场上。",
            "有的苹果是红色的，有的苹果是绿色的。",
            "有的人喜欢运动，有的人喜欢看书。",
            "有的城市很大，有的城市很小。",
            "有的菜很辣，有的菜不辣。",
            "有的同学住在宿舍，有的同学住在家里。",
            "有的人早起，有的人晚起。",
            "有的国家很冷，有的国家很热。",
            "有的工作很轻松，有的工作很辛苦。"
        ],
        "pinyin": [
            "Yǒude... yǒude...",
            "Yǒude rén xǐhuan kāfēi, yǒude rén xǐhuan chá.",
            "Yǒude xuésheng zài jiàoshì lǐ, yǒude xuésheng zài cāochǎng shàng.",
            "Yǒude píngguǒ shì hóngsè de, yǒude píngguǒ shì lǜsè de.",
            "Yǒude rén xǐhuan yùndòng, yǒude rén xǐhuan kàn shū.",
            "Yǒude chéngshì hěn dà, yǒude chéngshì hěn xiǎo.",
            "Yǒude cài hěn là, yǒude cài bú là.",
            "Yǒude tóngxué zhù zài sùshè, yǒude tóngxué zhù zài jiā lǐ.",
            "Yǒude rén zǎo qǐ, yǒude rén wǎn qǐ.",
            "Yǒude guójiā hěn lěng, yǒude guójiā hěn rè.",
            "Yǒude gōngzuò hěn qīngsōng, yǒude gōngzuò hěn xīnkǔ."
        ],
        "english": [
            "Some... others...",
            "Some people like coffee, others like tea.",
            "Some students are in the classroom, others are on the playground.",
            "Some apples are red, others are green.",
            "Some people like sports, others like reading books.",
            "Some cities are big, others are small.",
            "Some dishes are spicy, others are not spicy.",
            "Some classmates live in dormitories, others live at home.",
            "Some people wake up early, others wake up late.",
            "Some countries are cold, others are hot.",
            "Some jobs are easy, others are hard."
        ]
    },
    "grammar_021": {
        "name": "Verb + 过 (guo)",
        "description": "Indicates past experience",
        "hanzi": [
            "Verb + 过 (guo)",
            "我吃过北京烤鸭。",
            "他去过中国。",
            "你看过这部电影吗？",
            "我们认识过。",
            "她学过日语。",
            "我用过这个软件。",
            "你听说过这个故事吗？",
            "我们见过面。",
            "他尝试过很多新事物。",
            "你参加过这种活动吗？"
        ],
        "pinyin": [
            "Dòngcí + guo",
            "Wǒ chī guo Běijīng kǎoyā.",
            "Tā qù guo Zhōngguó.",
            "Nǐ kàn guo zhè bù diànyǐng ma?",
            "Wǒmen rènshi guo.",
            "Tā xué guo Rìyǔ.",
            "Wǒ yòng guo zhège ruǎnjiàn.",
            "Nǐ tīngshuō guo zhège gùshi ma?",
            "Wǒmen jiàn guo miàn.",
            "Tā chángshì guo hěnduō xīn shìwù.",
            "Nǐ cānjiā guo zhè zhǒng huódòng ma?"
        ],
        "english": [
            "Verb + 过 (guo)",
            "I have eaten Peking duck before.",
            "He has been to China before.",
            "Have you watched this movie before?",
            "We have met before.",
            "She has learned Japanese before.",
            "I have used this software before.",
            "Have you heard of this story before?",
            "We have met face-to-face before.",
            "He has tried many new things before.",
            "Have you participated in this kind of activity before?"
        ]
    },
    "grammar_022": {
        "name": "把 + Object + Verb",
        "description": "Used to emphasize the object being acted upon",
        "hanzi": [
            "把 + Object + Verb",
            "请把门关上。",
            "他把作业做完了。",
            "我把衣服洗了。",
            "她把房间打扫干净了。",
            "请把窗户打开。",
            "我把钱包放在桌子上了。",
            "他把书还给了图书馆。",
            "妈妈把菜煮好了。",
            "老师把考试题目念了一遍。",
            "我把这件事忘记了。"
        ],
        "pinyin": [
            "Bǎ + Object + Verb",
            "Qǐng bǎ mén guān shàng.",
            "Tā bǎ zuòyè zuò wán le.",
            "Wǒ bǎ yīfu xǐ le.",
            "Tā bǎ fángjiān dǎsǎo gānjìng le.",
            "Qǐng bǎ chuānghu dǎkāi.",
            "Wǒ bǎ qiánbāo fàng zài zhuōzi shàng le.",
            "Tā bǎ shū huán gěi le túshūguǎn.",
            "Māma bǎ cài zhǔ hǎo le.",
            "Lǎoshī bǎ kǎoshì tímù niàn le yī biàn.",
            "Wǒ bǎ zhè jiàn shì wàngjì le."
        ],
        "english": [
            "把 + Object + Verb",
            "Please close the door.",
            "He finished his homework.",
            "I washed the clothes.",
            "She cleaned the room thoroughly.",
            "Please open the window.",
            "I put the wallet on the table.",
            "He returned the book to the library.",
            "Mom cooked the dishes.",
            "The teacher read the exam questions once.",
            "I forgot about this matter."
        ]
    },
    "grammar_023": {
        "name": "是不是 / 好不好 / Verb-not-Verb",
        "description": "Question structures",
        "hanzi": [
            "是不是 / 好不好 / Verb-not-Verb",
            "这是不是你的书？",
            "我们去公园好不好？",
            "你喜不喜欢中国菜？",
            "他是不是你的朋友？",
            "我们现在出发好不好？",
            "你吃不吃辣的食物？",
            "这个电影好不好看？",
            "你去不去超市？",
            "这件衣服漂不漂亮？",
            "你听得懂不懂我说的话？"
        ],
        "pinyin": [
            "Shì bú shì / hǎo bù hǎo / Verb-not-Verb",
            "Zhè shì bú shì nǐ de shū?",
            "Wǒmen qù gōngyuán hǎo bù hǎo?",
            "Nǐ xǐ bu xǐhuan Zhōngguó cài?",
            "Tā shì bú shì nǐ de péngyou?",
            "Wǒmen xiànzài chūfā hǎo bù hǎo?",
            "Nǐ chī bu chī là de shíwù?",
            "Zhège diànyǐng hǎo bù hǎokàn?",
            "Nǐ qù bu qù chāoshì?",
            "Zhè jiàn yīfu piào bu piàoliang?",
            "Nǐ tīng de dǒng bu dǒng wǒ shuō de huà?"
        ],
        "english": [
            "是不是 / 好不好 / Verb-not-Verb",
            "Is this your book?",
            "Shall we go to the park?",
            "Do you like Chinese food?",
            "Is he your friend?",
            "Shall we leave now?",
            "Do you eat spicy food?",
            "Is this movie good to watch?",
            "Are you going to the supermarket?",
            "Is this clothing beautiful?",
            "Do you understand what I'm saying?"
        ]
    },
    "grammar_024": {
        "name": "一...就...",
        "description": "As soon as...",
        "hanzi": [
            "一...就...",
            "他一到家就开始做作业。",
            "我一看到她就想笑。",
            "天一黑就回家。",
            "她一听到这个消息就哭了。",
            "我一吃辣的东西就流汗。",
            "他一紧张就说话结巴。",
            "雨一停我们就出去玩。",
            "我一看到狗就害怕。",
            "他一拿到工资就去买新手机。",
            "你一说我就明白了。"
        ],
        "pinyin": [
            "Yī... jiù...",
            "Tā yī dào jiā jiù kāishǐ zuò zuòyè.",
            "Wǒ yī kàn dào tā jiù xiǎng xiào.",
            "Tiān yī hēi jiù huí jiā.",
            "Tā yī tīng dào zhège xiāoxi jiù kū le.",
            "Wǒ yī chī là de dōngxi jiù liú hàn.",
            "Tā yī jǐnzhāng jiù shuōhuà jiébā.",
            "Yǔ yī tíng wǒmen jiù chūqù wán.",
            "Wǒ yī kàn dào gǒu jiù hàipà.",
            "Tā yī ná dào gōngzī jiù qù mǎi xīn shǒujī.",
            "Nǐ yī shuō wǒ jiù míngbai le."
        ],
        "english": [
            "As soon as...",
            "As soon as he gets home, he starts doing homework.",
            "As soon as I see her, I want to laugh.",
            "As soon as it gets dark, go home.",
            "As soon as she heard the news, she cried.",
            "As soon as I eat spicy food, I start sweating.",
            "As soon as he gets nervous, he starts to stutter.",
            "As soon as the rain stops, we'll go out to play.",
            "As soon as I see a dog, I get scared.",
            "As soon as he gets his salary, he goes to buy a new phone.",
            "As soon as you said it, I understood."
        ]
    }
}
