{
    "story_001": {
        "hanzi": "小明喜欢吃苹果。他每天都买一个苹果。有一天，他看到一个很大的苹果。他很想买，但是钱不够。他回家问妈妈要钱。妈妈给了他钱。小明很高兴地买了那个大苹果。",
        "pinyin": "Xiǎo Míng xǐhuān chī píngguǒ. Tā měitiān dōu mǎi yí gè píngguǒ. Yǒu yì tiān, tā kàn dào yí gè hěn dà de píngguǒ. Tā hěn xiǎng mǎi, dànshì qián bú gòu. Tā huí jiā wèn māma yào qián. Māma gěi le tā qián. Xiǎo Míng hěn gāoxìng de mǎi le nà gè dà píngguǒ.",
        "english": "Xiao Ming likes to eat apples. He buys an apple every day. One day, he saw a very big apple. He wanted to buy it, but didn't have enough money. He went home and asked his mother for money. His mother gave him money. Xiao Ming happily bought that big apple.",
        "title": "小明的苹果",
        "title_eng": "Xiao Ming's Apple",
        "title_pin": "Xiǎo Míng de píngguǒ"
    },
    "story_002": {
        "hanzi": "小红有一只猫。这只猫很爱喝水。有一天，小红忘了给猫水喝。猫很渴，到处找水。它看到了鱼缸里的水。它想喝鱼缸里的水。小红回来了，看到了猫。她给猫水喝。猫很高兴。",
        "pinyin": "Xiǎo Hóng yǒu yì zhī māo. Zhè zhī māo hěn ài hē shuǐ. Yǒu yì tiān, Xiǎo Hóng wàng le gěi māo shuǐ hē. Māo hěn kě, dàochù zhǎo shuǐ. Tā kàn dào le yú gāng lǐ de shuǐ. Tā xiǎng hē yú gāng lǐ de shuǐ. Xiǎo Hóng huí lái le, kàn dào le māo. Tā gěi māo shuǐ hē. Māo hěn gāoxìng.",
        "english": "Xiao Hong has a cat. This cat loves to drink water. One day, Xiao Hong forgot to give the cat water. The cat was very thirsty and looked for water everywhere. It saw water in the fish tank. It wanted to drink water from the fish tank. Xiao Hong came back and saw the cat. She gave the cat water to drink. The cat was very happy.",
        "title": "小红的猫",
        "title_eng": "Xiao Hong's Cat",
        "title_pin": "Xiǎo Hóng de māo"
    },
    "story_003": {
        "hanzi": "小李很喜欢吃面条。他每天都吃面条。有一天，他妈妈做了米饭。小李不想吃米饭。妈妈说：'吃不同的东西对身体好。'小李想了想，决定吃米饭。他发现米饭也很好吃。从那天起，他开始吃不同的食物。",
        "pinyin": "Xiǎo Lǐ hěn xǐhuān chī miàntiáo. Tā měitiān dōu chī miàntiáo. Yǒu yì tiān, tā māma zuò le mǐfàn. Xiǎo Lǐ bù xiǎng chī mǐfàn. Māma shuō: 'Chī bù tóng de dōngxi duì shēntǐ hǎo.' Xiǎo Lǐ xiǎng le xiǎng, juédìng chī mǐfàn. Tā fāxiàn mǐfàn yě hěn hǎo chī. Cóng nà tiān qǐ, tā kāishǐ chī bù tóng de shíwù.",
        "english": "Xiao Li really likes to eat noodles. He eats noodles every day. One day, his mother made rice. Xiao Li didn't want to eat rice. Mom said: 'Eating different things is good for your body.' Xiao Li thought about it and decided to eat rice. He found that rice was also delicious. From that day on, he started to eat different foods.",
        "title": "小李学吃新食物",
        "title_eng": "Xiao Li Learns to Eat New Food",
        "title_pin": "Xiǎo Lǐ xué chī xīn shíwù"
    },
    "story_004": {
        "hanzi": "小王有一个红色的书包。他每天带着书包去学校。有一天，他的书包不见了。他很伤心。他到处找。后来，他在教室里找到了。原来他忘记带回家了。小王很高兴，他决定以后要记得带书包。",
        "pinyin": "Xiǎo Wáng yǒu yí gè hóngsè de shūbāo. Tā měitiān dài zhe shūbāo qù xuéxiào. Yǒu yì tiān, tā de shūbāo bú jiàn le. Tā hěn shāngxīn. Tā dàochù zhǎo. Hòulái, tā zài jiàoshì lǐ zhǎo dào le. Yuánlái tā wàngjì dài huí jiā le. Xiǎo Wáng hěn gāoxìng, tā juédìng yǐhòu yào jìde dài shūbāo.",
        "english": "Xiao Wang has a red schoolbag. He takes the schoolbag to school every day. One day, his schoolbag disappeared. He was very sad. He looked everywhere. Later, he found it in the classroom. It turned out he had forgotten to bring it home. Xiao Wang was very happy, and he decided to remember to bring his schoolbag in the future.",
        "title": "小王的书包",
        "title_eng": "Xiao Wang's Schoolbag",
        "title_pin": "Xiǎo Wáng de shūbāo"
    },
    "story_005": {
        "hanzi": "小张喜欢唱歌。她每天都唱歌。有一天，学校要举行歌唱比赛。小张想参加。她每天都练习。比赛那天，小张唱得很好。她得了第一名。她很高兴。从那以后，她更喜欢唱歌了。",
        "pinyin": "Xiǎo Zhāng xǐhuān chàng gē. Tā měitiān dōu chàng gē. Yǒu yì tiān, xuéxiào yào jǔxíng gēchàng bǐsài. Xiǎo Zhāng xiǎng cānjiā. Tā měitiān dōu liànxí. Bǐsài nà tiān, Xiǎo Zhāng chàng de hěn hǎo. Tā dé le dì yī míng. Tā hěn gāoxìng. Cóng nà yǐhòu, tā gèng xǐhuān chàng gē le.",
        "english": "Xiao Zhang likes to sing. She sings every day. One day, the school was going to hold a singing competition. Xiao Zhang wanted to participate. She practiced every day. On the day of the competition, Xiao Zhang sang very well. She won first place. She was very happy. Since then, she has liked singing even more.",
        "title": "小张爱唱歌",
        "title_eng": "Xiao Zhang Loves to Sing",
        "title_pin": "Xiǎo Zhāng ài chàng gē"
    },
    "story_006": {
        "hanzi": "小刘有一只小狗。这只小狗很爱玩。有一天，小刘带小狗去公园。小狗看到一只兔子。它想追兔子。小刘说：'不要追。'小狗听话了。小刘很高兴。他给小狗一个玩具。小狗很开心。",
        "pinyin": "Xiǎo Liú yǒu yì zhī xiǎo gǒu. Zhè zhī xiǎo gǒu hěn ài wán. Yǒu yì tiān, Xiǎo Liú dài xiǎo gǒu qù gōngyuán. Xiǎo gǒu kàn dào yì zhī tùzi. Tā xiǎng zhuī tùzi. Xiǎo Liú shuō: 'Bú yào zhuī.' Xiǎo gǒu tīnghuà le. Xiǎo Liú hěn gāoxìng. Tā gěi xiǎo gǒu yí gè wánjù. Xiǎo gǒu hěn kāixīn.",
        "english": "Xiao Liu has a puppy. This puppy loves to play. One day, Xiao Liu took the puppy to the park. The puppy saw a rabbit. It wanted to chase the rabbit. Xiao Liu said: 'Don't chase.' The puppy listened. Xiao Liu was very happy. He gave the puppy a toy. The puppy was very happy.",
        "title": "小刘的小狗",
        "title_eng": "Xiao Liu's Puppy",
        "title_pin": "Xiǎo Liú de xiǎo gǒu"
    },
    "story_007": {
        "hanzi": "小天很喜欢画画。他每天都画画。有一天，他画了一幅很漂亮的画。他想给妈妈看。但是他找不到妈妈。他到处找。后来，他在厨房找到了妈妈。妈妈正在做饭。妈妈看了画，很喜欢。小天很高兴。",
        "pinyin": "Xiǎo Tiān hěn xǐhuān huà huà. Tā měitiān dōu huà huà. Yǒu yì tiān, tā huà le yì fú hěn piàoliang de huà. Tā xiǎng gěi māma kàn. Dànshì tā zhǎo bú dào māma. Tā dàochù zhǎo. Hòulái, tā zài chúfáng zhǎo dào le māma. Māma zhèng zài zuò fàn. Māma kàn le huà, hěn xǐhuān. Xiǎo Tiān hěn gāoxìng.",
        "english": "Xiao Tian really likes to draw. He draws every day. One day, he drew a very beautiful picture. He wanted to show it to his mother. But he couldn't find his mother. He looked everywhere. Later, he found his mother in the kitchen. Mom was cooking. Mom looked at the drawing and liked it very much. Xiao Tian was very happy.",
        "title": "小天的画",
        "title_eng": "Xiao Tian's Drawing",
        "title_pin": "Xiǎo Tiān de huà"
    },
    "story_008": {
        "hanzi": "小美喜欢吃冰淇淋。有一天，她买了一个冰淇淋。她想回家吃。但是天很热，冰淇淋开始化了。小美走得很快。她终于到家了。冰淇淋没有完全化。小美很高兴。她觉得这是最好吃的冰淇淋。",
        "pinyin": "Xiǎo Měi xǐhuān chī bīngqílín. Yǒu yì tiān, tā mǎi le yí gè bīngqílín. Tā xiǎng huí jiā chī. Dànshì tiān hěn rè, bīngqílín kāishǐ huà le. Xiǎo Měi zǒu de hěn kuài. Tā zhōngyú dào jiā le. Bīngqílín méiyǒu wánquán huà. Xiǎo Měi hěn gāoxìng. Tā juéde zhè shì zuì hào chī de bīngqílín.",
        "english": "Xiao Mei likes to eat ice cream. One day, she bought an ice cream. She wanted to go home to eat it. But the weather was very hot, and the ice cream started to melt. Xiao Mei walked very fast. She finally got home. The ice cream hadn't completely melted. Xiao Mei was very happy. She thought this was the most delicious ice cream.",
        "title": "小美的冰淇淋",
        "title_eng": "Xiao Mei's Ice Cream",
        "title_pin": "Xiǎo Měi de bīngqílín"
    },
    "story_009": {
        "hanzi": "小强很喜欢踢足球。他每天都踢球。有一天，他的球不见了。他很难过。他到处找。他问朋友，朋友说没看到。后来，他在家门口找到了。原来是爸爸把球拿进去了。小强很高兴，他继续踢球。",
        "pinyin": "Xiǎo Qiáng hěn xǐhuān tī zúqiú. Tā měitiān dōu tī qiú. Yǒu yì tiān, tā de qiú bú jiàn le. Tā hěn nánguò. Tā dàochù zhǎo. Tā wèn péngyou, péngyou shuō méi kàn dào. Hòulái, tā zài jiā ménkǒu zhǎo dào le. Yuánlái shì bàba bǎ qiú ná jìn qù le. Xiǎo Qiáng hěn gāoxìng, tā jìxù tī qiú.",
        "english": "Xiao Qiang really likes to play soccer. He plays soccer every day. One day, his ball disappeared. He was very sad. He looked everywhere. He asked his friends, but they hadn't seen it. Later, he found it at his doorstep. It turned out his father had taken it inside. Xiao Qiang was very happy, and he continued to play soccer.",
        "title": "小强的足球",
        "title_eng": "Xiao Qiang's Soccer Ball",
        "title_pin": "Xiǎo Qiáng de zúqiú"
    },
    "story_010": {
        "hanzi": "小雨喜欢看书。她每天都看书。有一天，她去图书馆。她找到一本很有趣的书。但是她忘记带图书卡了。她很难过。图书管理员说：'没关系，你明天再来。'第二天，小雨带着图书卡来了。她终于借到了那本书。她很开心。",
        "pinyin": "Xiǎo Yǔ xǐhuān kàn shū. Tā měitiān dōu kàn shū. Yǒu yì tiān, tā qù túshūguǎn. Tā zhǎo dào yì běn hěn yǒuqù de shū. Dànshì tā wàngjì dài túshū kǎ le. Tā hěn nánguò. Túshū guǎnlǐ yuán shuō: 'Méi guānxi, nǐ míngtiān zài lái.' Dì èr tiān, Xiǎo Yǔ dài zhe túshū kǎ lái le. Tā zhōngyú jiè dào le nà běn shū. Tā hěn kāixīn.",
        "english": "Xiao Yu likes to read books. She reads books every day. One day, she went to the library. She found a very interesting book. But she forgot to bring her library card. She was very sad. The librarian said: 'It's okay, you can come back tomorrow.' The next day, Xiao Yu came with her library card. She finally borrowed that book. She was very happy.",
        "title": "小雨借书",
        "title_eng": "Xiao Yu Borrows a Book",
        "title_pin": "Xiǎo Yǔ jiè shū"
    }
}
