{
    "story_001": {
        "hanzi": "今天我去超市买东西。我买了面包、牛奶和一些水果。超市里的人很多，我等了很久才到我。然后我回家吃了面包和水果，真好吃。",
        "pinyin": "Jīntiān wǒ qù chāoshì mǎi dōngxī. Wǒ mǎi le miànbāo, niúnǎi hé yīxiē shuǐguǒ. Chāoshì lǐ de rén hěn duō, wǒ děng le hěn jiǔ cái dào wǒ. Ránhòu wǒ huí jiā chī le miànbāo hé shuǐguǒ, zhēn hǎo chī.",
        "english": "Today I went to the supermarket to buy things. I bought bread, milk, and some fruit. There were many people in the supermarket, and I waited a long time for my turn. Then I went home and ate the bread and fruit. It was delicious.",
        "title": "去超市",
        "title_eng": "Going to the Supermarket",
        "title_pin": "Qù chāoshì"
    },
    "story_002": {
        "hanzi": "我和朋友今天去公园。我们在公园里走了很久，聊天和看花。天很蓝，花很美。然后我们一起吃了午饭，真开心。",
        "pinyin": "Wǒ hé péngyǒu jīntiān qù gōngyuán. Wǒmen zài gōngyuán lǐ zǒu le hěn jiǔ, liáotiān hé kàn huā. Tiān hěn lán, huā hěn měi. Ránhòu wǒmen yīqǐ chī le wǔfàn, zhēn kāixīn.",
        "english": "My friend and I went to the park today. We walked in the park for a long time, talking and looking at the flowers. The sky was very blue, and the flowers were beautiful. Then we had lunch together. It was really nice.",
        "title": "去公园",
        "title_eng": "Going to the Park",
        "title_pin": "Qù gōngyuán"
    },
    "story_003": {
        "hanzi": "昨天晚上我看了一部电影。电影很有意思，我看得很开心。电影结束后，我去睡觉了。",
        "pinyin": "Zuótiān wǎnshàng wǒ kàn le yī bù diànyǐng. Diànyǐng hěn yǒuyìsi, wǒ kàn de hěn kāixīn. Diànyǐng jiéshù hòu, wǒ qù shuìjiào le.",
        "english": "Last night I watched a movie. The movie was very interesting, and I enjoyed watching it. After the movie ended, I went to bed.",
        "title": "看电影",
        "title_eng": "Watching a Movie",
        "title_pin": "Kàn diànyǐng"
    },
    "story_004": {
        "hanzi": "我有一个好朋友，她叫小丽。我们每天一起上学，一起做作业。她很聪明，我很喜欢和她一起玩。",
        "pinyin": "Wǒ yǒu yī gè hǎo péngyǒu, tā jiào Xiǎo Lì. Wǒmen měitiān yīqǐ shàngxué, yīqǐ zuò zuo yè. Tā hěn cōngmíng, wǒ hěn xǐhuān hé tā yīqǐ wán.",
        "english": "I have a good friend named Xiaoli. We go to school together every day and do homework together. She is very smart, and I like playing with her.",
        "title": "好朋友",
        "title_eng": "Good Friend",
        "title_pin": "Hǎo péngyǒu"
    },
    "story_005": {
        "hanzi": "我的家不大，有三间房间和一个小客厅。家里有很多书，我喜欢看书。晚上我会在客厅里看电视。",
        "pinyin": "Wǒ de jiā bù dà, yǒu sān jiān fángjiān hé yī gè xiǎo kètīng. Jiā lǐ yǒu hěn duō shū, wǒ xǐhuān kàn shū. Wǎnshàng wǒ huì zài kètīng lǐ kàn diànshì.",
        "english": "My house is not big. It has three rooms and a small living room. There are many books at home, and I like to read. In the evening, I watch TV in the living room.",
        "title": "我的家",
        "title_eng": "My Home",
        "title_pin": "Wǒ de jiā"
    },
    "story_006": {
        "hanzi": "今天是我的生日，妈妈做了蛋糕给我吃。朋友们来家里玩，我们一起唱歌、吃蛋糕，真快乐。",
        "pinyin": "Jīntiān shì wǒ de shēngrì, māma zuò le dàngāo gěi wǒ chī. Péngyǒumen lái jiā lǐ wán, wǒmen yīqǐ chànggē, chī dàngāo, zhēn kuàilè.",
        "english": "Today is my birthday, and my mom made a cake for me. My friends came over to play, and we sang and ate cake together. It was really fun.",
        "title": "我的生日",
        "title_eng": "My Birthday",
        "title_pin": "Wǒ de shēngrì"
    },
    "story_007": {
        "hanzi": "每天下午，我会去图书馆看书。图书馆里很安静，我可以认真学习。",
        "pinyin": "Měitiān xiàwǔ, wǒ huì qù túshūguǎn kàn shū. Túshūguǎn lǐ hěn ānjìng, wǒ kěyǐ rènzhēn xuéxí.",
        "english": "Every afternoon, I go to the library to read. The library is very quiet, and I can study carefully.",
        "title": "去图书馆",
        "title_eng": "Going to the Library",
        "title_pin": "Qù túshūguǎn"
    },
    "story_008": {
        "hanzi": "周末我常常去朋友家。我们一起玩游戏，有时候还会一起去外面吃饭。",
        "pinyin": "Zhōumò wǒ chángcháng qù péngyǒu jiā. Wǒmen yīqǐ wán yóuxì, yǒu shíhòu hái huì yīqǐ qù wàimiàn chīfàn.",
        "english": "On weekends, I often go to my friend's house. We play games together, and sometimes we go out to eat.",
        "title": "周末的活动",
        "title_eng": "Weekend Activities",
        "title_pin": "Zhōumò de huódòng"
    },
    "story_009": {
        "hanzi": "我有一辆自行车，每天我骑自行车去学校。路上有很多车，所以我要小心。",
        "pinyin": "Wǒ yǒu yī liàng zìxíngchē, měitiān wǒ qí zìxíngchē qù xuéxiào. Lùshàng yǒu hěn duō chē, suǒyǐ wǒ yào xiǎoxīn.",
        "english": "I have a bicycle, and I ride it to school every day. There are many cars on the road, so I have to be careful.",
        "title": "骑自行车",
        "title_eng": "Riding a Bike",
        "title_pin": "Qí zìxíngchē"
    },
    "story_010": {
        "hanzi": "冬天到了，天气变得很冷。我每天都要穿很多衣服，还要带帽子和手套。",
        "pinyin": "Dōngtiān dàole, tiānqì biàn de hěn lěng. Wǒ měitiān dōu yào chuān hěn duō yīfu, hái yào dài màozi hé shǒutào.",
        "english": "Winter is here, and the weather has become very cold. Every day, I have to wear many clothes, and I also wear a hat and gloves.",
        "title": "冬天来了",
        "title_eng": "Winter is Here",
        "title_pin": "Dōngtiān láile"
    },
    "story_011": {
        "hanzi": "今天早上，我和妈妈一起去市场。市场里有很多东西卖，有水果、蔬菜、肉和鱼。我们买了很多新鲜的东西，然后回家做饭。",
        "pinyin": "Jīntiān zǎoshang, wǒ hé māma yīqǐ qù shìchǎng. Shìchǎng lǐ yǒu hěn duō dōngxī mài, yǒu shuǐguǒ, shūcài, ròu hé yú. Wǒmen mǎi le hěn duō xīnxiān de dōngxī, ránhòu huí jiā zuò fàn.",
        "english": "This morning, my mom and I went to the market together. There were many things for sale, like fruit, vegetables, meat, and fish. We bought a lot of fresh food and then went home to cook.",
        "title": "去市场",
        "title_eng": "Going to the Market",
        "title_pin": "Qù shìchǎng"
    },
    "story_012": {
        "hanzi": "我家附近有一家很好的咖啡店。每次我去那儿，都会喝一杯热咖啡，有时候还会带一本书，边喝边看。",
        "pinyin": "Wǒ jiā fùjìn yǒu yī jiā hěn hǎo de kāfēi diàn. Měi cì wǒ qù nà er, dūhuì hē yī bēi rè kāfēi, yǒu shíhòu hái huì dài yī běn shū, biān hē biān kàn.",
        "english": "There is a very nice coffee shop near my house. Every time I go there, I drink a cup of hot coffee, and sometimes I bring a book to read while drinking.",
        "title": "去咖啡店",
        "title_eng": "Going to the Coffee Shop",
        "title_pin": "Qù kāfēi diàn"
    },
    "story_013": {
        "hanzi": "小明今天生病了，他不能去上学。他在家里休息，喝了很多水，妈妈也照顾他。",
        "pinyin": "Xiǎo Míng jīntiān shēngbìng le, tā bù néng qù shàngxué. Tā zài jiā lǐ xiūxí, hē le hěn duō shuǐ, māma yě zhàogù tā.",
        "english": "Xiao Ming is sick today, so he can't go to school. He is resting at home, drinking a lot of water, and his mom is taking care of him.",
        "title": "生病了",
        "title_eng": "Got Sick",
        "title_pin": "Shēngbìng le"
    },
    "story_014": {
        "hanzi": "小红每天都骑自行车去学校。她有一只黑白色的小狗，叫小黑。每天，小黑都会跟在她的自行车旁边跑。路上的人看到他们，都会笑着说：“你们真可爱！”",
        "pinyin": "Xiǎo Hóng měitiān dōu qí zìxíngchē qù xuéxiào. Tā yǒu yī zhī hēibái sè de xiǎo gǒu, jiào Xiǎo Hēi. Měitiān, Xiǎo Hēi dūhuì gēn zài tā de zìxíngchē pángbiān pǎo. Lùshàng de rén kàn dào tāmen, dūhuì xiào zhe shuō: “Nǐmen zhēn kě'ài!”",
        "english": "Xiao Hong rides her bicycle to school every day. She has a black-and-white dog named Xiao Hei. Every day, Xiao Hei runs alongside her bicycle. People on the road smile and say, 'You two are so cute!'",
        "title": "小红和小黑",
        "title_eng": "Xiao Hong and Xiao Hei",
        "title_pin": "Xiǎo Hóng hé Xiǎo Hēi"
    },
    "story_015": {
        "hanzi": "晚上我喜欢听音乐。我的房间很安静，我会坐在床上，打开手机，听我最喜欢的歌。听音乐让我觉得很放松。",
        "pinyin": "Wǎnshàng wǒ xǐhuān tīng yīnyuè. Wǒ de fángjiān hěn ānjìng, wǒ huì zuò zài chuáng shàng, dǎkāi shǒujī, tīng wǒ zuì xǐhuān de gē. Tīng yīnyuè ràng wǒ juédé hěn fàngsōng.",
        "english": "In the evening, I like to listen to music. My room is very quiet, and I sit on my bed, turn on my phone, and listen to my favorite songs. Listening to music makes me feel very relaxed.",
        "title": "听音乐",
        "title_eng": "Listening to Music",
        "title_pin": "Tīng yīnyuè"
    },
    "story_016": {
        "hanzi": "周末的时候，我和爸爸一起去爬山。山上有很多树和花，空气很新鲜。我们爬了很久，虽然有点累，但很开心。",
        "pinyin": "Zhōumò de shíhòu, wǒ hé bàba yīqǐ qù páshān. Shān shàng yǒu hěn duō shù hé huā, kōngqì hěn xīnxiān. Wǒmen pá le hěn jiǔ, suīrán yǒu diǎn lèi, dàn hěn kāixīn.",
        "english": "On weekends, my dad and I go hiking together. There are many trees and flowers on the mountain, and the air is very fresh. We hiked for a long time. Although it was a little tiring, we were very happy.",
        "title": "爬山",
        "title_eng": "Hiking",
        "title_pin": "Páshān"
    },
    "story_017": {
        "hanzi": "昨天晚上下了很多雨。我在家里看着窗外，雨打在地上，发出很大的声音。到了早上，雨停了，太阳出来了。",
        "pinyin": "Zuótiān wǎnshàng xià le hěn duō yǔ. Wǒ zài jiā lǐ kàn zhe chuāng wài, yǔ dǎ zài dì shàng, fāchū hěn dà de shēngyīn. Dào le zǎoshang, yǔ tíng le, tàiyáng chū lái le.",
        "english": "It rained a lot last night. I watched from inside the house as the rain hit the ground, making a loud sound. By the morning, the rain stopped, and the sun came out.",
        "title": "下雨的夜晚",
        "title_eng": "Rainy Night",
        "title_pin": "Xiàyǔ de yèwǎn"
    },
    "story_018": {
        "hanzi": "我有一个小弟弟，他今年五岁了。小弟弟很喜欢玩玩具车，每天他都会在家里跑来跑去，假装开车。",
        "pinyin": "Wǒ yǒu yī gè xiǎo dìdi, tā jīnnián wǔ suì le. Xiǎo dìdi hěn xǐhuān wán wánjù chē, měitiān tā dūhuì zài jiā lǐ pǎo lái pǎo qù, jiǎzhuāng kāichē.",
        "english": "I have a little brother who is five years old this year. He loves playing with toy cars and runs around the house every day pretending to drive.",
        "title": "小弟弟的玩具车",
        "title_eng": "Little Brother's Toy Car",
        "title_pin": "Xiǎo dìdi de wánjù chē"
    },
    "story_019": {
        "hanzi": "我的学校很大，有很多学生。我们每天上五节课，下午三点放学。我最喜欢的课是中文课，因为中文很有意思。",
        "pinyin": "Wǒ de xuéxiào hěn dà, yǒu hěn duō xuéshēng. Wǒmen měitiān shàng wǔ jié kè, xiàwǔ sān diǎn fàngxué. Wǒ zuì xǐhuān de kè shì Zhōngwén kè, yīnwèi Zhōngwén hěn yǒuyìsi.",
        "english": "My school is very big, with many students. We have five classes every day, and school ends at 3 pm. My favorite class is Chinese because it's very interesting.",
        "title": "我的学校",
        "title_eng": "My School",
        "title_pin": "Wǒ de xuéxiào"
    },
    "story_020": {
        "hanzi": "晚上我喜欢和朋友一起去吃饭。我们会去一家小餐馆，点很多好吃的菜，比如炒饭、面条和饺子。吃完饭，我们会聊天，聊很多有趣的事情。",
        "pinyin": "Wǎnshàng wǒ xǐhuān hé péngyǒu yīqǐ qù chīfàn. Wǒmen huì qù yī jiā xiǎo cānguǎn, diǎn hěn duō hǎo chī de cài, bǐrú chǎofàn, miàntiáo hé jiǎozi. Chī wán fàn, wǒmen huì liáotiān, liáo hěn duō yǒuqù de shìqíng.",
        "english": "In the evening, I like to go eat with friends. We go to a small restaurant and order a lot of delicious dishes, like fried rice, noodles, and dumplings. After eating, we chat and talk about many interesting things.",
        "title": "和朋友吃饭",
        "title_eng": "Eating with Friends",
        "title_pin": "Hé péngyǒu chīfàn"
    }
}
